{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Mark F.",
    "yelp_id": "1wa2p6LZuhOlex2iLRMP5w",
    "user_location": "Toledo, OH",
    "rating": 5,
    "review_date": "5/5/2017",
    "comments": "A five star rating takes more than great service, and wonderful meals coming out the kitchen. It takes a unique atmosphere, the best technology, a comfortable vibe - and creativity.The Stillery is a busy place. I like that. When you arrive, if there's a wait, they'll take your cell phone number and text you when your table is ready. In Nashville, that let's you experience another great band, while your table is clearing. You'll notice the people. They all seem to like their jobs. Even though waiting tables is one of the hardest jobs anyone will ever have, this team makes it look easy.The menu is killer and the food that is described in it is even better. I was in a party of three and all reported 'best ever' meal out. My food note: The pizza is as good as it looks. Authentic, fresh, perfectly prepared.Five star establishment... no doubt.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "James G.",
    "yelp_id": "_FOJDdmrO87p3M9PwyOZMA",
    "user_location": "New York, NY",
    "rating": 4,
    "review_date": "5/6/2017",
    "comments": "Best meal I had in Nashville! There was a bit of a wait for a table when we got there so we waited at the bar upstairs. Service was friendly, cocktails and beer were good plus they had live music (obviously) that was my favourite in Nashville (it basically wasn't country music)Once we sat down we were served quickly and I ordered the catfish just to have something different to all the chicken I had been having. It was amazing, lightly battered and actually the best tasting food I had in Nashville. My wife had the hot chicken, which she wasn't a fan of but I quite liked it. TBH I just think the food in Nashville wasn't all that it had been hyped up to be and as such, we were expecting more. If you're in Nashville though, this is the place to go.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Christa F.",
    "yelp_id": "VVyIz8Z73MU9RbZA_JoyRA",
    "user_location": "Wheaton, IL",
    "rating": 4,
    "review_date": "5/4/2017",
    "comments": "Wandering around Broadway, you have a ton of choices for food. Get of the main drag and opt for something amazing! There were 3 of us, so we agreed to get 3 things and split them 3 ways!Mac n Cheese - Cavatappi, house cheese sauce, baked with buttery breadcrumbs... You can't go wrong with their amazing bescamel sauce that they hugs to make the cheese sauce!Philly Cheese Steak Pizza - Grilled sirloin, house cheese sauce, mozz, caramelized onion, pretzel crust make this pizza taste like the real thing! The crust has a great chew!MC Burger - Cheddar, bacon, prosciutto, fried egg, roasted garlic aioli on an oversized English muffin... Why haven't we had a burger on an English muffin before?! Graft combo!!We highly recommend this place!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Cassie G.",
    "yelp_id": "bsMGQruRQGgQZK4KA9Q4Aw",
    "user_location": "Miami, FL",
    "rating": 4,
    "review_date": "4/27/2017",
    "comments": "The Stillery is a great option for dinner while hitting the touristy part of Nashville. On a Thursday night, we snagged a booth near the kitchen during primetime but in general, it was pretty busy. I'd recommend reservations in the future just to be safe. It was our first night in Nashville so it only made sense to kick off the weekend with mason jar cocktails. I went with the Strawberry Rye, Pennington's Strawberry Rye Whiskey, muddled strawberries, gingerbeer and lemon-lime soda. It sure was sweet but managed to pack a punch! For eats, the menu is just what you want before (or after) drinking on Broadway. We started with pretzels that came with spicy pub cheese and honey mustard. From there, it was a tough decision. Sandwiches, pizza, mac & cheese... How does one decide? Well again, it was our first night in Nashville so I decided to go with the hot chicken tenders that came with friends and collard greens. Lemme just say the portion was HUGE. I could only finish half. I got the house hot and it was actually the perfect degree of spicy, but could definitely be too much for someone averse to spice. Everyone at the table really enjoyed their meals! Just thinking about it I want some more now.The service was friendly and the food came out quick! The live music is upstairs but there was a TV down below where we could watch and hear what was happening which was kind of nice. All in all, I would totally recommend coming to The Stillery while downtown. Definitely the best meal I've had in this area in quite some time.\n        Was this review …?\n    ",
    "votes_useful": 9,
    "votes_funny": 2,
    "votes_cool": 9
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Daina M.",
    "yelp_id": "frIiDayrnrLs0kZb3_kTAw",
    "user_location": "Morton Grove, IL",
    "rating": 5,
    "review_date": "4/12/2017",
    "comments": "I cannot believe I've been in Nashville for three years, walked up and down Broadway as many times as I have, and never been here. It is absolutely amazing. My fiancé and I shared the Mac n cheese topped with hot chicken and the Brussels sprout pizza. We'd asked for no bacon on the pizza but unfortunately, when it was brought out, it did have bacon on it. However, when we pointed this out to the waitress she took it back right away. Although it did take time to make another pizza for us, the manager came to us and offered to take the pizza off our bill, which was nice. People make mistakes, no biggie when they have good customer service about it! And to be honest, I didn't mind the extra wait for the new pizza 'cuz it gave me the peace of mind that it was being freshly made :)Anyway, back to the food - the Mac n cheese was MIND BLOWING. One of the best dishes in Nashville for sure. I'm extremelyyy picky when it comes to Mac n cheese but I LOVED this one. My fiancé wasn't sure how the hot chicken on top would be, fearing it may be soggy. But actually, the breaking was still crispy and so flavorful! We devoured it before the new pizza even came out. And by the time it did come out, we were pretty full for the pizza. We had to try it fresh though so we had a slice each - it was delicious. The crust was just beautiful - buttery, soft on the inside, crisp on the outside. We heated up the leftovers in the oven the next day and they were still real good! We also had a side of fries, yummy!We went on a Wednesday night after a random night out on Broadway. We tried going again the next Saturday 'cuz we'd been craving it since, but the wait was about 45min. Not surprised though! Can't wait to go back\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Allison J.",
    "yelp_id": "ciLjqqXFSRYpdPSmazaoDA",
    "user_location": "Chicago, IL",
    "rating": 5,
    "review_date": "4/27/2017",
    "comments": "Holy Mac & Cheese! Heavy and in no way healthy, but totally worth it for a cheat day! This place is casual, affordable and the food was deliciously filling. Our table of four ordered two Mac & Cheese with Hot Chicken, a Steak & Shrooms pizza and a Prosciutto & Arugula pizza and it was an excessive amount of food! We basically took home half a pizza and half an order of Mac! The Mac & Cheese was so creamy & rich.. and while I normally douse my Mac n cheese with loads of Sriracha, this one came pre-spicy-fied with Hot Chicken. The chicken isn't very spicy but has a great hot sauce taste that cuts through all the cheese! It was really delicious! Both of the pizzas were different, but equally good. The Steak & Shrooms pizza was richer and more decadent with the steak, mushrooms and blue cheese, while the Prosciutto & Argula was lighter. Both great depending on your palate and mood!Altogether, nothing that I wouldn't order again!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Stephanie Y.",
    "yelp_id": "17ZfmktUwF9Ou5bk541o-w",
    "user_location": "Boston, MA",
    "rating": 5,
    "review_date": "4/23/2017",
    "comments": "Came here for dinner with my fiance. It was on his to eat list during our visit to Nashville specifically for the hot chicken mac and cheese. After eating too much fried chicken and ribs on our first few days in Nashville we shared the steak sandwich with a side of green salad. Highly recommend! The sandwich was nice and cheesy and flavorful. I also ordered the blueberry smash which was DELICIOUS! A solid choice for a $8 cocktail (such a steal!). We came again the day after because my fiance and I couldn't stop thinking about the hot chicken mac and cheese. Unfortunately I wasnt feeling well but my fiance loved the mac and cheese and devoured it. I ordered the small caesar salad which was solid for $5. Definitely stop by The Stillery!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Stephanie P.",
    "yelp_id": "ruWDkskuDvzUy8m6eO4Vlw",
    "user_location": "Birmingham, AL",
    "rating": 5,
    "review_date": "3/25/2017",
    "comments": "Who knew some of the best food in Nashville was right off of Broadway!! OMG! We came for lunch and were blown away. We split the Hot Chicken Mac & Cheese and The Meats pizza. Both were AMAZING!The Mac and Cheese was hands down the best Mac & Cheese ever. The sauce was ridiculously good. I wanted to lick the skillet. I'm obsessed with the Mac & Cheese!The pizza was fantastic! Tons of toppings and we absolutely LOVED the coarse salt on the crust. This was our first time at The Stillery but certainly not our last. The restaurant fills up quickly - make a reservation if you can!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Jen D.",
    "yelp_id": "U81IV9jujA7ZwH3qGDHZRQ",
    "user_location": "Brooklyn, NY",
    "rating": 4,
    "review_date": "4/23/2017",
    "comments": "Best meal in Nashville!  The wings with the house sauce are delicious.   Very meaty with not much fat.  The Sriracha deviled eggs were some of the best deviled eggs I've tasted.  My only wish was that they have draft beers!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Lessa P.",
    "yelp_id": "JvRsTrzH6SrYgajgsvseIQ",
    "user_location": "Fairbanks, AK",
    "rating": 5,
    "review_date": "4/24/2017",
    "comments": "Great service at the upstairs bar. I tried the blueberry splash drink, the Mac and cheese with Nashville Hot Chicken and the cor-basil.All tasted great! The cor-basil was a little annoying to drink with the basil going up the straw and ice blocking but the blueberry drinks was delicious!I could really get used to eating that Mac and cheese with Nashville hot chicken ... it was soooo good. \"Small\" plate was very filling. The music was alright. It was an odd crowd with very random suggestions to the musicians but he took all the requests with a stride. He even sang Hakuna Matata with different voices and all.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Cori Z.",
    "yelp_id": "Gf9LwNXRdlWzWFXHUXXRzA",
    "user_location": "Tulsa, OK",
    "rating": 5,
    "review_date": "4/17/2017",
    "comments": "I had my eye on this place before we even got to Nashville. When we arrived, we met a friendly couple at brunch one day and they had mentioned that they loved The Stillery, only confirming that I HAD to go. We called around lunch time to see if they accepted reservations for dinner. They told me they did not, but that dinner for two shouldn't be much of a wait, if at all. Which ended up being correct. We walked over there around 7 or 7:30 and got a table immediately on a Friday night. The main reason I wanted to go was for the mac and cheese, but I had heard the pizza was incredible. We ended up ordering a pizza, a size of mac and cheese, and a wedge salad (all to split). Everything was phenomenal. I wasn't really feeling pizza that night, but after I tasted it I almost ate the whole thing. HOLY COW the dough was so good- and I think it's made in-house! The mac and cheese was also incredible.\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Jon S.",
    "yelp_id": "BUeqfrO3j65uzd9RxC6gbw",
    "user_location": "Swedesboro, NJ",
    "rating": 4,
    "review_date": "4/17/2017",
    "comments": "Good lunch spot just around the corner from Broadway but away from the hustle and bustle.  We got a salad and a pizza - the homemade sausage was surprisingly good.  Good service and nice space - worth a shot.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Abbi B.",
    "yelp_id": "J4MnAq2lPLmOqsjKH0v4cg",
    "user_location": "Suwanee, GA",
    "rating": 5,
    "review_date": "4/20/2017",
    "comments": "What a great place! Had lunch here today arrived as they had just opened. Our waiter Cody was awesome!! Me and my husband shared the cast iron wings, pepperoni pie and Caesar salad. The pie was incredible!! I love pizza and have eaten a lot of it but I have never had any as good as this one!! The cast iron wings were so yummy we had the house hot and it was the perfect amount of spicy. The Caesar salad was huge piled high...it's not your normal salad you can taste a hint of lemon and garlic, super yummy! Also, the sweet tea is great. Restaurant was clean, bathrooms nice and clean. If your looking for a great little spot with live music check this place out you will be happy you did... oh and ask for Cody.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Audra B.",
    "yelp_id": "KcW9zFiNioxsDNg20aeWfQ",
    "user_location": "Palm Harbor, FL",
    "rating": 5,
    "review_date": "5/5/2017",
    "comments": "Cute little place just off of broadway with great service, great pizzas and amazing moonshine drinks served in mason jars! For the ultimate Nashville experience, I opted for the hot chicken pizza. It was delicious, but definitely hot and definitely not individual-sized like the menu has you believe. Between the 3 of us at the table, we tried about 4 different drinks and they were all excellent!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Dana H.",
    "yelp_id": "TJ9QlvMaPnu0R0USu722oQ",
    "user_location": "Manhattan, NY",
    "rating": 4,
    "review_date": "4/16/2017",
    "comments": "Stopped here after landing and came straight from the airport to kill some time. It's your typical casual bar/restaurant on Broadway, but the food is actually super yummy! They have tons of different pizzas, all huge portions and flavorful. Their cocktails all come in cute mason jars. I ordered the mac and cheese, and it was super yummy and cheesy. It was also a perfect portion size and cheaper as it's technically an appetizer. The waitress was very friendly, and we overall had a really great experience!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Ronald W.",
    "yelp_id": "x9rkVoNB92HR_bFOe6MFTQ",
    "user_location": "Redmond, WA",
    "rating": 2,
    "review_date": "3/1/2017",
    "comments": "I had the mac and cheese with hot chicken strips on top. The mac and cheese was mellow with no distinctive flavor. They didn't ask for spice level of the hot chicken which came not hot at all which was disappointing. Good quantity for one.Service was very good, but I wish the food were better.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Billy H.",
    "yelp_id": "SBjQX8BNQk4KtLVf8W14zQ",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "2/15/2017",
    "comments": "Look, I'm not a Nashville native, but having lived here for 6 years, I feel -somewhat- like one, having seen the boom in the growth of Nashville in the past 3ish years. I don't care for country music, and Broadway isn't really my scene. We came downtown to take some pictures and eat down the street at Bakersfield. It was SuperBowl Sunday and they'd closed for an employee's party. We were left to fend for ourselves and locate a new place for lunch. Yelp saved the day, or maybe I saved the day because I had The Stillery bookmarked. Located on 2nd, right off of Broadway, I was a little worried that it would be like the other restaurants along the tourist trap area of downtown. I was pleasantly surprised with the whole experience. Our server was super friendly and helpful with suggestions. They had a nice selection of craft beers, and they even had a guy up on the back of the bar singing songs, and they weren't all country. I ordered the 'meats' pizza, which consists of pepperoni, prosciutto, soppressata, hot Italian sausage, red sauce, Parmesan and mozzarella ($14). This pizza, omg. It was literally the best pizza I've had in Nashville, or anywhere in a really long time. The crust was puffy, flakey, perfect. All the thinly cut meats on top. PERFECTION. We also ordered the fish and chips ($14.50). The fish had a great batter on it, it was served on lettuce, which kind of got the batter a little damp. The fries could've been served a little warmer too, but they had a great flavor. Next time we go, I think I'll try a different pizza, but it'll be hard to not order the meats pizza again.\n        Was this review …?\n    ",
    "votes_useful": 4,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Maddie F.",
    "yelp_id": "Kho08pWNfeGnRbZTnMKy3w",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "2/27/2017",
    "comments": "Three words: Hot chicken pizza. This place is right off Broadway so a great choice if you're planning to hit the bars after. I was a little surprised when I walked in to see a performer virtually on top of the bar performing but it was awesome. He had a great voice and was entertaining. Service was good, food was good, location is excellent, vibe is casual but still a place you can feel comfortable spending some time. The portions are pretty big here so my friend and I shared the chopped salad and of course the glory that is hot chicken pizza (get it..just get it!) we both wished we could've boxed the rest and taken it home but alas we were on our way to a concert. Go here and you will not be disappointed--you get a lot of bang for your buck!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Tiffany K.",
    "yelp_id": "7Q5BhwEAeKXxsNc6W85vPQ",
    "user_location": "Spencer, IN",
    "rating": 5,
    "review_date": "5/1/2017",
    "comments": "Good beer, great drinks, and good food. What more could you ask for? We weren't too hungry so my boyfriend and I shared the mac and cheese with hot chicken. It was great mac and cheese. There was enough cheese in the skillet so the macaroni wasnt too dry. The chicken was spicy but not overly spicy. We also got a mixed drink: hunch punch. Its made of ole smokey hunch punch moonshine, house sour, and lemon lime soda. Good people ipa wasn't bad either.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Diana J.",
    "yelp_id": "3ymyVHTDmxbaKNfOe8xgjw",
    "user_location": "Chicago, IL",
    "rating": 4,
    "review_date": "2/17/2017",
    "comments": "1.) They take reservations!!!2.) Service was prompt and friendly, food came out fast.3.) 3 ppl shared the following:- Jalapeno rangoons: pretty good, what's not to like with deep fried and cream cheese? I wish there was more of a jalapeno taste though, the cream cheese def overpowered.- Cesar salad: Pass on this one. Just a bunch of shredded lettuce with little sauce, cheese or taste.- Brussel sprout pizza: dough was delicious! Chewy, soft and garlic-buttery! The brussel sprouts were boiled, chopped and then baked on the pizza... I could taste the boiledness. I wish the whole thing was roasted instead. But overall, it was more than plenty for 3 girls!- Hot chicken over mac n cheese: HIGHLIGHT of our meal by far! The chicken was juicy and piping hot, with the most delicious hot sauce I've had in Nashville! We asked for a cup on the side to dip in! The pasta noodles were perfect to capture all the melty cheesy goodness in the skillet. WILL BE BACK TO EAT THIS AGAIN AND AGAIN AND AGAIN.4.) Awesome live music upstairs, which they broadcast on TVs downstairs (where we sat). The girl's voice was incredible!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Stephanie S.",
    "yelp_id": "pAHSCvnBqd5K9HRJudg6Mg",
    "user_location": "Clovis, CA",
    "rating": 4,
    "review_date": "4/25/2017",
    "comments": "This place has one of the best Mac N Cheeses I have ever tried! I cannot wait to come back here. Also tried some moonshine cocktails, they were good but almost too strong to enjoy. I will be coming back here next time I'm in Nashville.It's hidden away in downtown with a cool ambiance and decor.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Lacey K.",
    "yelp_id": "L-3e3WTwsmS_j4mstzKh-w",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "4/3/2017",
    "comments": "The only reason I didn't give them 5 is because our waitress came to our table 3 times, to take our order & our check & wasn't friendly at all. But the food & atmosphere is amazing. They had a musician who sang beautifully. We got the jalapeno wontons, so yummy & the Hot Chicken Mac&Cheese is AMAZING. One of the BEST Meals I've had in Nashville. & that's saying a lot.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 2
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Mindy J.",
    "yelp_id": "olTwlyGQWPChGdXSw0OOZg",
    "user_location": "Smyrna, TN",
    "rating": 5,
    "review_date": "2/2/2017",
    "comments": "Dude......Oh. Em. Geesus.This place is my jam.Based on yelp pics, I've been wanting to eat here since last year, but the day we made the reservation (my 30th bday) they had a fire,.. I'm so glad they rebuilt!! We finally made it tonight and WOW!! Let's start- Service: Kristin,.. AWESOME! We loved her. Very knowledgeable and just the right amount of attentiveness. Perfect, we both thought... she even let us wait to order our food til we were done eating our appAnd the app- HOLY SHNIKES,... the 'snack board'- oh my god not a snack lol. It was enough for my meal- which you'll later read I had to take home because I was so full.Entree- my husband was brave enough to actually try and stuff more into his belly and ordered the Meat pizza. He raved about it yall... and if you know my husband, he's not easy to get a rise out of. I tried a few pieces- sausage was spicy but so flavorful, the prosciutto, pepperoni & soppressata were so crisp and perfect, and the crust was just so light and airy, and every single thing you would want it to be. Mmmmm,.. Ima have to stop lolBut skip that Sbarro crap on 2nd and go grab a pie at the Stillery!!((Also- like I said, had to order mine Togo- hot chicken and Mac of course,... chicken is SPICY! Definitely not the Buffalo flavor she said lol, but so good!!))\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Julie G.",
    "yelp_id": "PBSrmFYGlxHW09quJb78WA",
    "user_location": "Chicago, IL",
    "rating": 4,
    "review_date": "4/4/2017",
    "comments": "Ate here because of the Yelp reviews. Did not disappoint! We got a pizza which the dough was nice and fresh, steak on it was tender. We also got the Mac and cheese with the hot chicken on it- yum. Mac and cheese was a good consistency. For never having hot chicken I'm sure this isn't the place to get the good stuff but it was still yummy! Staff was really nice- good beer selection.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Cassie C.",
    "yelp_id": "506keshsLa102eajCtaZ_A",
    "user_location": "Thousand Oaks, CA",
    "rating": 5,
    "review_date": "4/7/2017",
    "comments": "Came here on a Tuesday night after a work event as I had it bookmarked on my Yelp when looking for places to eat while in Nashville for a couple nights :) It did not disappoint! My colleagues and myself wanted some good southern food--especially mac n cheese, so of course we chose here. The mac n cheese with hot fried chicken on top was DELICIOUS! Loved how it came in its own little cast iron skillet as well. I made sure to eat all of the chicken (which was hot, but not TOO hot--especially with the mac n cheese which balanced it out) and all of the crispy parts of the mac around the edges and top, but I couldn't finish the whole thing.I also ordered a couple mason jar cocktails which were dangerous since it tasted like regular peach tea, but definitely felt it afterwards! (Even after my meal). Definitely Instagram-worthy! Overall the interior is much smaller than I thought so the 5 of us in our party sat at the bar, and service was very fast! Upstairs was rented out for an event but we heard the live music and they even ended up putting the musician on the TVs downstairs so we could see.Great vibe, great place and great food and drinks!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Lindsay N.",
    "yelp_id": "y3SRcEYLnz-yewb2zf5F6w",
    "user_location": "Mesa, AZ",
    "rating": 4,
    "review_date": "4/27/2017",
    "comments": "Great food, great service! Came in on a Thursday for lunch and had the mac and cheese.... it definitely lived up to the reviews. SO GOOD!! Amazing. The pizza was also out of this world!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Eric J.",
    "yelp_id": "eSU_HjKOA3Ppt8oS07oYkw",
    "user_location": "New York, NY",
    "rating": 4,
    "review_date": "1/12/2017",
    "comments": "Our first stop for food in Nashville, and our first experience with hot chicken in Nashville as well. We were hanging out and listening to some live music nearby (duh), and were looking for a place that was open past 10 and had more than just alcohol. After looking up the Stillery on Yelp, we went for it. They also had live music playing, but we didn't know exactly where they were playing, since it was on the TV. Hot chicken sandwich was very solid, and the fries were crispy and delicious. There's always got to be a balance with hot chicken, so it remains crispy but has enough hot sauce to give the entire thing flavor. Brussels sprouts were a bit overcooked, but still decent overall, as there was a bit of a crisp on top to counter the mushiness. The pizza they had looked pretty good too, although most of us went for sandwiches because of the prospect of getting those fries.Prices were very reasonable, with our meals only being about $14, and the waitstaff was very kind and patient. It was a little cold outside, so they ended up moving us to a booth further indoors after the previous party had left. Pretty cool that they were willing to do that with more parties coming in. Overall, a really good place with solid food in the throngs of tourists near Broadway.  Good for both larger parties as well as small groups, and a good spot for some late(r) night eats.\n        Was this review …?\n    ",
    "votes_useful": 66,
    "votes_funny": 46,
    "votes_cool": 60
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Carla R.",
    "yelp_id": "GNk3IDzVLSz8elX0LO2sVQ",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "1/30/2017",
    "comments": "The Stillery has great food and great service and a great location! 1) The food: So delicious! *to start we shared Brussels sprouts, jalapeño bacon rangoons and Siracha deviled eggs*for dinner I ordered the mac and cheese with hot chicken. It is a huge portion and oh so delicious! *my husband had fish and chips and the fish was so tender and not greasy at all!2) The service: we had the best server ever! His name was Ben Kleir and he was awesome! He knew the menu, knew the drinks and was very attentive. 3) Location: 2nd street (love this street and its ambience). They have a great location. Close to the honky tonks and Bridgestone arena.I look forward to returning and trying some other dishes. Everything on their menu sounds delicious!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Ellen R.",
    "yelp_id": "uqbBrjbypFhcTbcg_UkVHA",
    "user_location": "Rockville, MD",
    "rating": 4,
    "review_date": "4/26/2017",
    "comments": "After reading a few positive reviews on Yelp, a friend and I decided to stop by The Stillery as we were passing through Nashville on a Wednesday night. First of all, we were both surprised by how PACKED it was, and we were extremely lucky to snag a seat at the bar just as another couple was leaving. We started by ordering two cocktails, both of which were great. Then we ordered food: mac & cheese with hot chicken and some kind of pizza with brussels sprouts. Both were tasty and filling, although the hot chicken was slightly dry (be sure to ask for extra sauce)! Service was decent, too. It's obvious that they were busy and a little overwhelmed, but we had a hard time flagging the bartender for more drinks. All in all, a good experience! Four stars, definitely recommend.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Mallory G.",
    "yelp_id": "NG3HtZLKkAEcNWsNVfcXsw",
    "user_location": "Saint Louis, MO",
    "rating": 3,
    "review_date": "3/15/2017",
    "comments": "Driving through Nashville and came here as per the yelp reviews. It's a small cozy place, conveniently located on Broadway, but it may be hard to get a table so I would make a reservation if I had a large party.I got the hot chicken + mac and cheese (again, as per the yelp reviews). It was good- the Mac and Cheese was adequately cheesy, the hot chicken was nice and spicy (although I could have had it spicier), and everything seemed to have generally good flavor. I sat and the bar and the service was good. Everyone was really friendly, not sure if that's a Nashville thing or just a special characteristic of this place. I got the blackberry fix mason jar cocktail, which the waitress stated was one of the more popular. It was OK. Not very strong, not particularly aesthetic (what was everyone going on about here?), but pretty tasty.I would give this place 4 stars, but the price for my meal + one weak drink was $25 (with tip). It was good, but not THAT good- perhaps a factor of being on Broadway. Still, didn't seem like a good value.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Carlos S.",
    "yelp_id": "AQ_YyxiZ1eJp5-jMMa05rQ",
    "user_location": "Norfolk, VA",
    "rating": 5,
    "review_date": "4/6/2017",
    "comments": "Great beer, good food and decent prices!Staff was very friendly, we sat at the bar, no live music but it was early.Highly recommend it\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Emoni A.",
    "yelp_id": "zOWJVdc1mFkmwSq9gNa8UA",
    "user_location": "Los Angeles, CA",
    "rating": 5,
    "review_date": "3/6/2017",
    "comments": "I'm from Los Angeles California, we eat everything in LA so I was coming to Nashville for the first time to visit my boyfriend who lives there, and before I was leaving to Nashville I was looking up good restaurants that would be good for my liking. So my last day which was today, before I head back to LA me and my boyfriend decided to try it out.Soon as we walked in the Hostess which was our waiter was so polite and sweet, sat us down, asked us for drinks and etc... I'm more of picture take of person, I have to see what I'm eating. So I decided to try the \"Mac and Cheese with Hot chicken, and my boyfriend decided to get the MC burger. So we decided we were gonna share each other food, and decided to switch each other's food that's how good they were!I HIGHLY RECOMMEND THIS PLACE IF YOUR VISITING NASHVILLE FOR THE FIRST TIME! GREAT GREAT FOOD FOR A CALIFORNIA GIRL LIKE MYSELF !\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 2
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Elizabeth R.",
    "yelp_id": "NWThWdXtMNxDZ-K_p-hPzA",
    "user_location": "Rio Rancho, NM",
    "rating": 5,
    "review_date": "3/9/2017",
    "comments": "Was here for a work meeting and found this on yelp. Delicious food. I had the hot chicken Mac and cheese. They aren't kidding that it was hot. Most impressive was the local drinks. I had the peach drink and couldn't stop drinking it.It has live music and lots of Nashville fun atmosphere\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Alana Z.",
    "yelp_id": "a5BcGDFDXh6KxfG1A4pilw",
    "user_location": "Boston, MA",
    "rating": 5,
    "review_date": "3/1/2017",
    "comments": "I have to admit. I ate here 2 days in a row. And I don't regret it. Because it was amazing BOTH TIMES. Definitely order the mac 'n cheese with hot chicken. The chicken is tender and the sauce is so unique. A bit of spice and slightly sweet. It's perfection. Get an extra side to dunk pizza crusts in. The mac 'n cheese is melty and cheesy and exactly what mac 'n cheese should be. I could eat this every day for the rest of my life. If I was okay with having a heart attack from excess saturated fats, ha!Pizza here is fantastic! The crust is good, the toppings are delicious. I would say you would be good to try any of them. Jalapeno rangoons are yummmm. Cream cheeeeeeeseee. Baaccccooonnnn. If you like cream cheese and bacon, this is your app.Try the drinks! They are fantastic. Hunch punch, blackberry lime, and the blueberry smash were my favorites.Service is on point! Food service is also quick. Which is important when you're drooling from staring at other people's food. Enjoy!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Jenifer G.",
    "yelp_id": "jqyCC_CE1KY6oSX8xD-FZg",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "4/13/2017",
    "comments": "I still love them after ordering simmering different, the pretzel burger. My, my, my it was good then and two days later.  I could even skip the fries and fully indulge in the delicious beef and bun.\n        Was this review …?\n    \n        Was this review …?\n    ",
    "votes_useful": 11,
    "votes_funny": 11,
    "votes_cool": 11
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Tiffany B.",
    "yelp_id": "WYOPCteXF76-6tQ1XKmCVw",
    "user_location": "Palatine, IL",
    "rating": 5,
    "review_date": "11/29/2016",
    "comments": "This place is as good as it gets!  No questions asked!! This is a small place located in downtown and upon arrival all tables were taken so my husband and I sat at the bar. The bartender took our order and was super friendly,  drinks came quick and super good. We ordered food and Omg what a tasty meal and tasty drink.  Everything we had was great.  I ordered a second drink now keep in mind it was the same drink and it was so consistent that I was very impressed on how yummy this drink was. Place was clean.  Did not make it to the ladies room so I can't comment. Food came out fast.  It was a awesome experience and I will say if you visit downtown Nashville you have to stop by this place.  I will come back on my future trip.\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 1,
    "votes_cool": 3
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Chelsey C.",
    "yelp_id": "jF0pIfzuF5_TJE3h0CAUIg",
    "user_location": "Aptos, CA",
    "rating": 5,
    "review_date": "3/20/2017",
    "comments": "Loved The Stillery. Incredible atmosphere with a cool interior design. Close enough to Broadway hubbub to be convenient, but off the path enough to be a much needed break from it all. Food is awesome, and really fairly priced. The cocktails are also a great deal, and so delicious! I was surprised at how good the prices were. The waitresses were also very kind. Definitely stop by if you want good food, good atmosphere, and quality without the flashiness of anything on touristy Broadway! Get the macaroni!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "John F.",
    "yelp_id": "xcVKnIKBUVEEHacIDh4eZQ",
    "user_location": "Bel Air, MD",
    "rating": 5,
    "review_date": "4/20/2017",
    "comments": "Do yourself a favor and eat at the Stillery. The service was quick, and our server actually answered questions about the food and drink menus! Honestly you see that too rarely these days. Hot chicken was great and portions were large. Great value all around.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Ron W.",
    "yelp_id": "mDQhgesXXOKaDQW2o00sMg",
    "user_location": "Santa Ana, CA",
    "rating": 4,
    "review_date": "11/25/2016",
    "comments": "I wanted to give my ears a break and my belly a breather. So, I stumbled in to The Stillery, a Brew Pup with lots of hub bub. And, of course, live music. In Vegas every toilet has a slot machine within arm's reach. Same for music in Nashville. The town is infested with live singers doin' covers of dead singers. Good idea as no one complains. This place is a comfy off- Broadway hit with a kitchen that can actually get the job done even with a few hits and  misses. But ain't that just show biz for ya? The Vibe: Mostly locals and noisy. Or maybe the locals are noisy as there is live music in gas station convenience food counters and everywhere else you can think of and a few places you can't. The patrons in The Stillery were trying to drown out the band, and the band was trying to drown out the band next door. You can wait over an hour for a table or hover over some poor soul at the copper top bar that has seen it's share of elbows. Stand there too close and ask lame questions about what they're eating until they pay and bolt. Voila, total time to sit...10 minutes. The Staff: Busy beavers. The Bar Program: Simple and direct. Some interesting house cocktails and no bashful pour here. The drinks all come in Mason Jars 3 times the normal size like a Japanese Monsta Flick. A Stillery Sour was George Dickle No. 12, Blackberry Jam and house made Sour.  The Strawberry Rye was Pennington's Strawberry Rye Whiskey, muddled Strawberries, Ginger Beer and Lemon-Lime Soda. Both drinks were big, bold, sweet as a Southern Belle and just as vicious if you ain't lookin (or lookin' too much).  The Food: Heavy, creamy or deeply fried (which also describes a frat party date), or all three on the same plate. But hey, y'all in the South now, Son. So, roll with it, Beach Ball.The Brussells Sprouts with whole garlic (no Walkin' Dead eatin' this stuff) comes with a Chili Vinaigrette and Ranch Dressing. This dish allows you to phone home and tell your Mum, \"Yup, I found something green to eat in this here town\".The Mac 'n Cheese (topped with Nashville Style Hot Chicken) was a step up on the creamy scale ladled over Fusilli, It was as gooey and cheesy as a Hallmark movie...in a good way. Was the chicken as good as Hattie B's? Nope, as the crunch was MIA. Have the mini version and save room for the rest of the bar food. A mini is more than adequate unless you've left a note on the nightstand in your hotel and planned to eat till you exploded. Here, if you're gonna do that, at least you'll be doin' it right.There is a gas fired oven which cranks out nicely blistered pizzas with generous toppings. The \"Meaty\" was Pepperoni, Prosciutto, Sorppressata, Hot Italian Sausage, Red Sauce, Mozzarella, and Herbs. A recipe for serious burping which no one will hear over the music anyway. Like a knock at your hotel room door it looks terrific when it arrives. However, the crust quickly goes all soft on you. So, roll it up and and make a hand crafted Calzone out of it. Does that work with your new friend who knocked? That's up to you two. Odds and Ends: The head was clean. Everything worked, including me. The live music from upstairs was piped in and as loud as if your head was on the stage at Robert's Western World in case you wanted to linger. And right in front of the urinal there was a large portrait of  Johnny Cash staring at your Hot Chicken. \"Hey, Johnny, I walk the line with no plans to cross over. Thank you.\" In the restaurant there are TV's all around showing everything except porn in case you're lonely or tired of talking to who you brought.  Watch a TV at the Stillery or stay home and watch re-runs of Hillary. I say, head out.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Melisa B.",
    "yelp_id": "9WvMB1HUVkj4DZrey0jE7A",
    "user_location": "Cincinnati, OH",
    "rating": 5,
    "review_date": "2/18/2017",
    "comments": "I really liked this place. The food was pretty good. The band on the second level was so good that we stayed another 2 hours just to listen after we were done with our meal. We had a meats pizza, Mac n cheese topped with hot chicken, and BBQ wings. Everything was really tasty.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Damian A.",
    "yelp_id": "1G0fw7ywVlg3TS9MIWpyUw",
    "user_location": "Adelaide, Australia",
    "rating": 4,
    "review_date": "2/8/2017",
    "comments": "Our first night in Nashville and we decided to go here based on Yelp reviews and we were not disappointed. The venue is nice and although very well presented and upmarket looking the cost is very affordable. We shared 2 pizza's and wished we only got one pizza as they are very large for one person. They tasted great and very fresh with a good base. The staff were friendly and attentive but not too much. We found parking easy but it is a Wednesday night and the location and surrounding atmosphere are very Nashville!!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 2
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Joe S.",
    "yelp_id": "2YwIrXAkvcNzi9ouAApqAQ",
    "user_location": "Elkhart, IN",
    "rating": 5,
    "review_date": "10/24/2016",
    "comments": "Came for dinner here for a couple of reasons.  1. The yelp reviews were very good, and 2. We had a vegetarian among us and it appeared there were good options here for her.  Both were accurate.We put our name in and waited for a text message to indicate it was time to come back almost 40 minutes later. We knew that was going to be the wait and it turned out to be worth it.The food was what made the wait most worthwhile. We had the fried pickles and jalapeño rangoon's for an appetizer. Both were excellent.  We decided to split several dishes as our main course. The mac & cheese with hot chicken was our favorite. The hot chicken was not as flavorful as others but mixed very well with the rich, creamy mac & cheese.  The tomato pesto flatbread was also very good.  The brussels sprouts were our least favorite thing of the night, but even they were highly edible.Top all of that off with great service and a very respectable selection of drinks including good craft beers and whiskey drinks. Great experience. Highly recommended.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Rebecca A.",
    "yelp_id": "YRzBOEnmlR_Jf4r2pGfdfw",
    "user_location": "Lisbon, ME",
    "rating": 5,
    "review_date": "11/16/2016",
    "comments": "This lovely little pub serves up some great grub. They also have a full menu of libations, including draft beers and speciality cocktails. The service was phenomenal. She was friendly and attentive. We never had to ask for a thing. She was so good at picking up subtleties and ensuring we had a wonderful meal. The jalapeño wonton app was creamy smoked spicy deliciousness. The outside was crispy and the inside was bursting with spicy creamy filling swirled with bacon and served with an amazing homemade ranch sauce.  The Mac n cheese was pure comfort food, thick creamy melty cheese with buttery crunchy breadcrumbs on top. This is even better than your grandmas. It a real stick your ribs meal. And is even better topped with the Nashville hot chicken. It is a fried chicken breast coated in that wonderful spicy sauce.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Tom D.",
    "yelp_id": "ZMCA3xgUZ5cCmEvnOD07LA",
    "user_location": "Lincoln, NE",
    "rating": 3,
    "review_date": "4/30/2017",
    "comments": "Came here with a party of six on a Sunday night expecting one of Nashville best downtown dining experiences based on reviews, but our experience missed that mark. The only highlights were the starter wings and the pizza. Their signature dish, macaroni and cheese topped with hot chicken was the problem. Macaroni was too dry, not enough cheese sauce or spice/salt and the hot chicken was so-so. I'd return for the pizza, but that's it.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Jordan D.",
    "yelp_id": "Ahd0tZTmAUEhgNHGYYm-aw",
    "user_location": "Angola, IN",
    "rating": 5,
    "review_date": "4/23/2017",
    "comments": "Great food, great staff, great atmosphere! I was dining alone at the bar and the bartender was awesome! The food is top notch and the price is very fair. Don't miss out on The Stillery if you are in Nashville!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Kaylyn E.",
    "yelp_id": "zPZZuEU9_2iXeAHu6UkTRQ",
    "user_location": "Lexington, KY",
    "rating": 4,
    "review_date": "11/12/2016",
    "comments": "I was unsure of what to expect thinking it was just another greasy Nashville joint, with over priced drinks and food, but I was wrong! Food: everything was so good. Appetizer: get the pretzels. I haven't had a better pretzel and the beer cheese is amazing. This is probably a good appetizer for two or three. Dinner: Luckily I was with a large group so I got to try a little of everything. The pizzas are very filling so it is easy to share one especially if you get an appetizer or side. If you like less heavy options my absolute favorite item on the menu is the hot chicken salad. The lettuce is chopped fine and the ranch is creamy and delicious.  Perfect pairing with the hot chicken. This can also be shared no problem with a side like macaroni. If you do not like spicy I would recommend staying away from the hot chicken it can make your nose run if you have a lot of it. I am a female so splitting works for me but if you are like my husband you could probably eat a plate solo. Atmosphere: perfect Nashville stop they had a wonderful duo playing upstairs that added to the whole experience. Can't wait to go back!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Justin G.",
    "yelp_id": "wjNIamQRhU-6loQJ61MplA",
    "user_location": "Birmingham, AL",
    "rating": 3,
    "review_date": "10/13/2016",
    "comments": "We were in Nashville for one night Sunday and wanted something within walking distance of the hotel so we settled on The Stillery. The location is pretty good and the atmosphere is OK. We went in and waited several minutes at the host stand before being greeted. Once we sat down it was another several minutes before our server came to the table - who happened to be the person who escorted us to the table. Not the greatest of starts but they could have been understaffed (it was a Sunday evening).I ordered the fried pickle chips to start with hot chicken over mac as the main. The pickles were crispy and well seasoned - by far the best thing we had. The runner up being the mac and cheese served in an iron skillet. The hot chicken was fine but lacked kick and flavor. I like to have a draft beer with my dinner but The Stillery did not have any offerings on tap - only in can or bottle. This is a bummer for me because it would have been the perfect pair to my meal. Overall the value was decent but the experience was forgettable.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 2,
    "votes_cool": 2
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Kate R.",
    "yelp_id": "YhhKcofsUX0VhF3YbV9BlQ",
    "user_location": "Maryville, TN",
    "rating": 4,
    "review_date": "2/10/2017",
    "comments": "Dined here for lunch today and loved it!We started off with the pretzels. They were hot, buttery, and salty--very good! They were served with mustard and a pimento cheese.I ordered the mac and cheese topped with hot chicken and it was divine! The mac and cheese was a perfect blend of creamy with a little bit of crunch thanks to a bread crumb topping and from being broiled. The hot chicken was delicious as well. Not too spicy and tender and juicy--my boyfriend ended up eating half of it he loved it so much!He ordered the pepperoni pizza. The flavors were on point with a nice garlic punch but the pizza was way to messy for my taste. You definitely need a knife and fork for it.My only conplaint was that the place is cramped. Sitting at the bar, we were constantly getting bumped into and having to suck in to let people pass.We sat at the bar and the bartender was very attentive. Our food took a while to get out to us but we were there in the middle of the lunch rush and the bartender stated a large order had gone in right before ours which caused the delay.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Hanni E.",
    "yelp_id": "tnApxPbeVym4hybfPcMcJg",
    "user_location": "Brussels, Belgium",
    "rating": 1,
    "review_date": "4/28/2017",
    "comments": "Took 20 minutes for anyone to even give us water, and our waitress Lauren only came over after we complained we had been waiting so long. Hardly even a sorry, didn't compensate any of our food and were ignored for 15 minutes after finishing our meal too. Had to stand up and find her to get the bill. Hostess didn't ask how our meal was or even say goodbye. Such disappointing service.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 2,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Neek C.",
    "yelp_id": "hbqYtojSshA6ekSAQukjCQ",
    "user_location": "Cordova, TN",
    "rating": 5,
    "review_date": "1/19/2017",
    "comments": "So...Nashville downtown parking...20 dollars...never again. I'm Ubering next time. The Stillery is a great place to eat. Mason jars for drinking glasses. Great atmosphere. Great food. I had the mac and cheese with hot chicken. It was amazing. Mac and cheese was cheesy and the hot chicken when well with it. Can't complain. Had a Jack Float [alcoholic beverage] and everything was chill. Definitely coming back but not parking downtown. LMAO!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 1,
    "votes_cool": 2
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Natalie W.",
    "yelp_id": "7Pl6yitAM2zQllTNMUlduw",
    "user_location": "Farmington, CT",
    "rating": 4,
    "review_date": "11/1/2016",
    "comments": "A solid four star restaurant. Good good, good drinks, good prices. Good but not the best. I really enjoyed the atmosphere and the company, both clientele and the bartender who served us. The food offerings were a fairly standard range done pretty well. The cheese appetizer was a home run and we really enjoyed it. The pizza met the definition but was a bit floppy - I'd be more inclined to call it a flatbread than pizza, personally. The drinks were a highlight - creative and utilizing local ingredients: something I love to see. I think it'd be hard to have an awful experience here but I'm not sure it would be the most memorable meal ever.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Eric P.",
    "yelp_id": "zwo_1JffE58mcx1Ec2X2cw",
    "user_location": "Athens, AL",
    "rating": 4,
    "review_date": "4/30/2017",
    "comments": "The hot chicken pie was very good. The Brussels Sprouts were a very tasty appetizer. Cool live music. Nice place to go.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Terri H.",
    "yelp_id": "DbNKK25oOzfHxyfBHlOaDg",
    "user_location": "Franklin, TN",
    "rating": 5,
    "review_date": "1/9/2017",
    "comments": "The service was excellent.  There were 18 of us and we were able to reserve the second floor on a Sunday night for our large group.  Our server was on top of everything.  We had plenty to drink and our food came out a lot quicker than I expected.  I wish I would have asked his name because he was the best.  He was very friendly and funny!We started with appetizers and drinks.  I ordered the Yee-Haw Dunkel which is one of my favorite local brews for a mere $5.  Drink prices were very reasonable.  Appetizers included jalapeno-bacon rangoons, wings, and a snack board.  I tried a wing and some of the cheese and prosciutto from the snack board.  It was a delicious start to a wonderful meal.A friend of mine and I decided we couldn't eat a whole pizza so we shared the meats pie.  When it arrived I was very glad we decided to share.  I'd rather try as many things as possible so I'm glad my friends are the same way.  I also tasted some of my husband's hot chicken tenders which he ordered XXhot and I had no business touching.  I cannot handle that much heat.  I also tried another friend's steak pie.  There is no way I could pick which pie I liked better as they were both awesome.  I feel like I just sampled around the table to try as many things as I could and everything was delicious.  This was the perfect place to have our little party.  They could not have been nicer or more accommodating!  I can't wait to come back to try the burgers!\n        Was this review …?\n    ",
    "votes_useful": 6,
    "votes_funny": 2,
    "votes_cool": 5
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Adam F.",
    "yelp_id": "JyKHbm-9VHadl5aqhGSEpw",
    "user_location": "Solon, OH",
    "rating": 1,
    "review_date": "3/20/2017",
    "comments": "Overall my experience at The Stillery was extremely negative, mostly due to the hostile attitudes of the wait staff and management. My friend was recovering from the flu and got sick in the restaurant's bathroom. This is obviously not an ideal situation, but she cleaned up after herself and at the very least we expected them to handle it with professionalism. Instead, the manager came directly to our table and in an extremely unfriendly tone told us we were cut off from alcohol. Ok, except for no one ordered an alcoholic beverage and we calmly tried to explain that our friend was independently sick. She went to the bathroom again and before she made it into the door, the manager came over, and in an even more hostile before, told us that they would be putting our food in to-go boxes. We told him we would prefer to simply cancel our order and spend our money elsewhere. I have been to hundreds of restaurants in my life, from fast food to Michelin starred, and i have never, ever been treated with such disrespect and hostility. I cannot advice against The Stillery strongly enough. Nashville is a beautiful city made even more beautiful by its warm, inviting, hospitable people. There are so many places to have an amazing experience here. Please don't waste your time on this one.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Sara H.",
    "yelp_id": "0usUHa_aYdpAlGtGW-c7Sw",
    "user_location": "Richmond, TX",
    "rating": 5,
    "review_date": "4/30/2017",
    "comments": "So yummy.  We had the brussel sprouts, pepperoni pizza and the macaroni topped with hot chicken.  The blueberry vodka drink is so good!!!  The pizza had a moist buttery crust.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Robin S.",
    "yelp_id": "qVy-ixKmDlRAB1Nfr1RszA",
    "user_location": "Madison, TN",
    "rating": 3,
    "review_date": "3/25/2017",
    "comments": "One of the better options for food downtown. My husband's wedge salad was good, but that's not hard to do. I've had the Mac & Cheese with hot chicken on two occasions - the first time it was good, but on this most recent visit the chicken was chewy and not very good. I couldn't finish it.On the plus side, wine was a generous pour.3.5 stars\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Stephanie S.",
    "yelp_id": "gX_UqVIT1Ut7r1XUj1y9ng",
    "user_location": "Clifton, NJ",
    "rating": 5,
    "review_date": "1/3/2017",
    "comments": "All I gotta say is wow, wow, WOW. Their mac and cheese covered in hot chicken is the S&%T! The mac and cheese was by far the creamiest and most mouthwatering variety I've ever had. The hot chicken complimented it so well too. Crispy white meat tenders in delicious hot seasoning - yum! I also tried the chopped salad and pizza. Lot of dressing on the salad, but it worked. I liked the taste of the dressing a lot - creamy balsamic style. The pizza wasn't half bad either. Highly recommend this place for an indulgent meal.\n        Was this review …?\n    ",
    "votes_useful": 5,
    "votes_funny": 2,
    "votes_cool": 3
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Justine L.",
    "yelp_id": "q3lv7obAox0Flfv7DRIS0g",
    "user_location": "Phoenix, AZ",
    "rating": 5,
    "review_date": "4/29/2017",
    "comments": "The Stillery is amazing. If I would have found this place my first day, I might have eaten here five days in a row. I'm a huge fan of smoky cocktails, and the Smokin' Mule did not disappoint. Plus who doesn't like drinking out of a mason jar? The salads are huge and reasonably priced, if you fancy yourself a break from BBQ and tacos. But if you want artery clogging goodness, the hot chicken Mac and cheese is probably the best thing I ate during my five days in Nashville, and we had a lot of great meals. The chicken was perfectly spicy, crispy on the outside and super tender and moist (I really freaking hate that word, that's how good this chicken is) on the inside. The cheese sauce on the Mac is creamy and amazing, plus bonus points for using cavatappi noodles! The bartender Michael is super sweet - gotta love that southern hospitality!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Lindsay S.",
    "yelp_id": "kn9lTp5mQN5WetsxIWTidQ",
    "user_location": "Nashville, TN",
    "rating": 3,
    "review_date": "4/24/2017",
    "comments": "Really good overall however the pepperoni pizza gave me heartburn for two days... service was good, lots of local beers in cans not drafts. We booked on OpenTable and had no problem, no other open tables. Pretzel appetizer was so so (cheese wasn't good) & the wontons were awesome! Plus live music, some original some  not & we went at 3:30 on a Saturday.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "the-stillery-nashville",
    "user_name": "Meg D.",
    "yelp_id": "g7Uoydq8ClIEmWPryCMUag",
    "user_location": "Charlotte, NC",
    "rating": 4,
    "review_date": "3/17/2017",
    "comments": "Great vibe (right on the main strip) with delicious food. We stopped to grab a quick bite to eat after landing from the airport on a business trip. I used Yelp to find The Stillery as there are so many options in Nashville to eat. There was no wait (on a Monday night) and we were seated at a booth immediately. The service was pretty good (nothing spectacular but the waitress was nice and checked in on us regularly.) Most of the group ordered beer from local breweries, which were in bottles, which was a bit disappointing that they didn't have any beers on draft. I ordered the blueberry smash, which other Yelp reviewers said wasn't strong, and I agree, but the flavor was good. I would have preferred it have a little bit more alcohol kick.I got the hot chicken mac and cheese and was definitely happy that I did. The chicken was spicy and flavorful, but not too hot, and the mac and cheese was great as well. I could only finish about half of the mac and cheese (but I ate all of the chicken of course.) Others in my group were pleased with the meals that they got as well, so I think you're safe if you don't get the hot chicken mac and cheese!Overall, this is a good place near Broadway to eat some hot chicken (and mac and cheese) and enjoy a couple beers/mixed drinks.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 1,
    "votes_cool": 1
},