{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Brianna H.",
    "yelp_id": "-JgkJcebL8c8a7lYyr9Mig",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "3/12/2017",
    "comments": "Amazing customer service & the food is so fresh & tastes amazing! I'm vegan and the staff allowed me to sample all of there vegan options before I ordered!  He ended up allowing me to do half and half of the two dishes I liked most! Half coconut soy, half bbq soy, with rice & peas & cabbage for just $9! I am definitely a new regular!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Valencia J.",
    "yelp_id": "e0ztk3NHn7VA4h5JucmG-A",
    "user_location": "Plano, TX",
    "rating": 4,
    "review_date": "4/28/2017",
    "comments": "Good food. Portion sizes are decent. I always get brown stew chicken (the gravy is yummy), rice and peas, and fried plantains. The meat falls off the bone every time. I won't order the cabbage again, had an odd taste to me. Try a johnny cake, they are quite different. The line can get long, so be patient. A lot of people will walk up and peek at the food since they're not very familiar with it. Just say excuse me and do so; that way when it's your turn to order, you're not standing there holding up the line. They have regular sodas, Jamaican beverages, bottled water and juices. There are a few desserts available too. I really enjoy the music while I'm eating, good vibes. Stop by if you want some good Jamaican food in Nashville. Parking can be a bit challenging during busier times (lunch time), so be prepared.\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 2,
    "votes_cool": 2
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "I P.",
    "yelp_id": "J--VO5fvTGNug_pMhE6wHQ",
    "user_location": "Marietta, GA",
    "rating": 4,
    "review_date": "4/28/2017",
    "comments": "The food here is absolutely delicious! I love the oxtails and with rice and peas. Cabbage and cornbread is unbelievable! It can be a little pricey and the line can be wrapped around the restaurant. But I'm willing to stand in the line as I have never been disappointed with my food or the service.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Tanya P.",
    "yelp_id": "EgB8MIRy6FwpxNGn76bxuw",
    "user_location": "Great Neck, NY",
    "rating": 4,
    "review_date": "12/27/2016",
    "comments": "I am a vegan and my husband is not.  Going to a new city and trying to figure out what we can both enjoy can be a challenge.  We found this place because it seemed to be great for both carnivores and vegans/vegetarians.  Everything is pre-made and you get to choose a protein and 2 sides.  Lots of options and everything looks great.   Well, the ONE thing I wanted (the tofu curry) was literally the only thing that they didn't have made yet.  The place had been open for over an hour at this point so it was sort of strange that they didn't have it ready.  The woman suggested I have the one other vegan dish but it was filled with peppers and onions, but I can't eat those 2 items so I opted to wait for the tofu which she said would only take about 15 minutes.  It was really more like a half hour, but I have to say it was REAL good.  I had the rice and beans and fried plantains as well (since those were the only 2 vegan sides), but I would have chosen those anyway.  Amazing plantains.  Not sure what they put in the tofu to make it so yellow, but it stained my mouth and hands for a whole day.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Davila T.",
    "yelp_id": "zkavdAkuJbV7XxFsVIThsw",
    "user_location": "Sydney, Australia",
    "rating": 5,
    "review_date": "6/13/2016",
    "comments": "I always yes when someone invites me to lunch here. As a vegan, I always leave there very full. Their food taste good and is made fresh; they are always cooking and restocking the display. I always get the curry tofu or the jerk vegan protein with rich/beans and plantains. It is hidden at the back of the Farmer's Market, so you can't see it when you're in the main seating area. It has its own seating area, a door to the outside, and generally plays reggae music to get you feeling like you're in Jamaica as you bite into your fried plantain.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Hui C.",
    "yelp_id": "bvBtfpCgD7RTthxaTVGJug",
    "user_location": "Manhattan, NY",
    "rating": 3,
    "review_date": "12/16/2015",
    "comments": "TL;DR: good spot for vegetarians. Got a stomachache from the vegetarian fried chicken, though, so maybe they use some ingredients that don't sit well with everyone.Food: they have great vegetarian dishes and vegetarian fried chicken. There's a whole section of vegetable dishes, but since other reviewers mentioned that their mango chutney fried chicken was good, I decided to try the vegetarian version. It was crispy, if a little bland, but had the texture of fried chicken. The mango chutney that it comes with is very sweet and added some flavor to the \"chicken\", but there's no mistakening this for actual fried chicken. Each entree comes with two sides, and I had the Jamaican rice and fried plantains. Rice was a little dry but had good flavor. Plantains could have been a little crisper outside but were soft inside and tasty. Portions are huge - I got a dine in plate and everything combined was a full dinner plate worth of food. Price: with tip, I spent exactly $10. It was super filling, and I would go back to try one of the veggie dishes.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jon J.",
    "yelp_id": "u9eB8i8rHZNuRC1sDWFq4Q",
    "user_location": "Nashville, TN",
    "rating": 2,
    "review_date": "3/3/2017",
    "comments": "Food was ok but terrible customer service. I'm next in line and the lady just walks off. I felt like she refused to take my order. She was popping her head around the corner looking for another customer. Finally some guy stops cleaning the floor to take my order. Did not receive a johnny cake with the order. The guy was polite but seemed new and kind of stressed out. That black lady who refused to take my order is a complete scumbag. I recommend the midtown location for good service and good food. I only went to the farmers market location for the boneless thigh. Quality of the food has went down over the past year. Doesn't have that authentic Jamaican feel.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Katie S.",
    "yelp_id": "WrsNZOMssxVjOfLaVnZrDQ",
    "user_location": "Frankfort, KY",
    "rating": 4,
    "review_date": "5/26/2016",
    "comments": "What a great place to try out some pretty authentic Jamaican food and its attached to a cool farmers market! As seen on triple D. check this place out and try something new!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Vanessa M.",
    "yelp_id": "uy0xhdRJlr5G_pn6PnRuQQ",
    "user_location": "Nashville, TN",
    "rating": 2,
    "review_date": "8/3/2016",
    "comments": "Boo. Lol. Seriously, when I moved here 5 years ago, the food was great. Now I won't even eat there anymore. Tried it again recently after 2 bad experiences in the past year or so-- and I will not be back! Meats needing long times to stew (beef,goat) are consistently chewy and not given proper time to cook. Goat was full of fat and gristle. The last 2 times, they were out of beef patties. At different times. Out of beef patties??! Unheard of at a real Jamaican spot. This place has turned into a Lon over rated tourist trap, and/or go-to place for people who have no clue what Jamaican food is supposed to taste like. Do yourself a favor-- skip it.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Kevin B.",
    "yelp_id": "N9JEIsYnfFI2E27Q3RXB3A",
    "user_location": "Nashville, TN",
    "rating": 2,
    "review_date": "9/2/2016",
    "comments": "I don't really get the 5 star reviews. This is a meat and two with a little different meat selection. The vegetables are right out of a can. Shoneys food is just as good and much more reasonably priced.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 2
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Roxy R.",
    "yelp_id": "Ytif5baie8HtNzxnRzaqEg",
    "user_location": "Chicago, IL",
    "rating": 5,
    "review_date": "10/21/2016",
    "comments": "Jamaicaway Restaurant vegan food was delicious! I only got take out but the food was so good (vegan spicy jerk gluten, plantains and rice) and the staff were very nice! I would definitely go back next time I am in Nashville.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "BykeRyde R.",
    "yelp_id": "CehMq3BdcwX6ZVlsKZj_sg",
    "user_location": "Philadelphia, PA",
    "rating": 4,
    "review_date": "12/21/2015",
    "comments": "Pros:  The food is amazing.  Delicious and on point.  Could rival any eatery in Queens and Jamaica.Cons:  The service is kind of crap.  No matter what time or day I walk in, or how many customers there are, it seems the staff is like Abbott and Costello meets Lucy and Ethel meets the WeebleWobbles...really unorganized, bumping into each other all the time, and confusing orders.  It's haha funny until the eighth time; I mean c'mon guys.  It's not that hard to be casual, yet efficient, at the same time.  For example: if you chose to leave your restaurant music on but perhaps turned the volume down, you may not muck up your customer's order (as well as when ringing it up), wasting your time and their's.(During another visit, I asked a younger female associate if she could turn the music down.  She looked at me like I just ordered sushi and reluctantly adjusted the volume).My bottom line is:  their service would match their food if they maybe focused more on the customers and less on they themselves \"having fun\".\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jason D.",
    "yelp_id": "wo5QavnrMex2rXuZBRyrJQ",
    "user_location": "Millington, TN",
    "rating": 4,
    "review_date": "6/18/2015",
    "comments": "This is a great little place. The ladies behind the counter are so cute and friendly. Very helpful and actually appear to enjoy their job. The line is fast but they don't rush you. The employees are worth the visit alone. I liked the smiles. I had the spicy jerked chicken. It taste better than the jerk chicken I had in Jamaica. The meat was very tender and the jerk sauce was delicious. The rice and beans were really good and was better with the jerk sauce on it. Cheese mashed potatoes were not that good. Overall a great lunch, quick and filling. Now go find a place to nap!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Adiah P.",
    "yelp_id": "uPbdBtlvo6JA0DuBnB6WMg",
    "user_location": "Katy, TX",
    "rating": 5,
    "review_date": "10/27/2016",
    "comments": "My husband and I ordered food from here through the DoorDash app, and the food was so good. We got the jerk chicken, greens, and sweet potatoes. I tried the carrot mango juice which is also really good! Definitely going to be ordering from here again!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Julie G.",
    "yelp_id": "FMKJCaAwY7AOpMZ_wqa23A",
    "user_location": "Minneapolis, MN",
    "rating": 5,
    "review_date": "8/28/2016",
    "comments": "We were so grateful to stop for lunch here on a leg of our road trip from Saint Louis to Gatinlburg. Exquisitely veggie-friendly, delectable food that tastes home-cooked and lovingly from-scratch. We ordered several items and loved each of them. The coconut-tofu vegetarian entree leaves me longing for more. We also engoyed the setting inside of the farmers market. We actually grabbed some incredible ice cream next door on the way out. Can't wait to get back to Nashville....\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Abby K.",
    "yelp_id": "JluiUv88bkA5RU0jy5pF0w",
    "user_location": "Tampa, FL",
    "rating": 5,
    "review_date": "12/13/2016",
    "comments": "This place is amazing! It's inside the Farmer's Market and is one of the few places open past 4. Excellent dinner! The cheesy mashed potatoes were phenomenal, and I loved their spicy cabbage. I also had their curry chicken which was equally amazing. What a great find!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Tim S.",
    "yelp_id": "7JAdkaWbXuXA4YULqxKaMg",
    "user_location": "Monument, CO",
    "rating": 3,
    "review_date": "6/9/2015",
    "comments": "This place has promise, and I will be back to try more of the menu.  The sides were what really had me going this visit, the collard greens and brown rice (had some sort of spiced gravy going on in it) were awesome.  The spicy jerk chicken was decent, but not spicy and contained a lot of tiny sharp bones.  I love that they have multiple ginger drinks, including some very respectable ginger beer.  The interior is perhaps a bit too authentic Jamaican, all the way down to the torn up booth cushions :-)So the first visit was a bit hit and miss, but as I said I will be back.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Rachel W.",
    "yelp_id": "KzBByIbPbrd-rWLvv9BUNA",
    "user_location": "Houston, TX",
    "rating": 5,
    "review_date": "7/20/2016",
    "comments": "Omg! Cheap but some of the most delicious Jamaican food you can get in Nashville. The meat patties are fresh and flaky. The cabbage is spicy and tender. The curry chicken and goat are perfectly marinated and tender. The oxtail are little bit more but so worth every dime.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Lisa B.",
    "yelp_id": "X0Bmllln5u8i37-Fo8leVg",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "9/15/2015",
    "comments": "I ventured out from my usual lunch go-tos at the Farmer's Market to give Jamaicaway a try today *pats self on back.* Guy Fieri creepily looked down at me from his signed DD&D poster and stamp on the wall approving of my choice. Most people in line seemed like repeat customers and knew exactly what was what and what they wanted - I was the loser who had to ask for a tutorial. Woops.  The line was a decent length, but moved quickly. I went with the mild jerk chicken (spice wimp here), yellow rice and fried plantains. Around $10 for that and a drink. The mild jerk is boneless, but the spicy appeared to have bones. Everything was good and very flavorful, but I'll branch out a little more with my sides next time. The greens also looked amazing and a jonny cake or patty would have been a good addition to my plate of mushy (in a good way) food.  Others looked like they had 2 sides and a jonny cake, so maybe I just got overlooked on that one?The atmosphere is nothing fancy, just a few tables and worn booths, but it does have it's own separate seating area away from the cafeteria-style open space used by the rest of the restaurants there.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Ray J.",
    "yelp_id": "AaMABCD1ET4EoNs3nM1HNQ",
    "user_location": "Galveston, TX",
    "rating": 5,
    "review_date": "6/5/2016",
    "comments": "This is one of the best restaurants in Nashville and one of my favorite restaurants of all time. It has become a family tradition since my parents moved here... The food and service are incredible! I usually get the the jerk chicken, fried plantains, and johnnycakes. There are also plenty of great options for vegetarians- the Coconut Delight is super yummy. Definitely try the Jamaican sodas too! I really love the Nashville Farmer's Market, so the location is perfect after a day of shopping. Highly recommended!!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Tara K.",
    "yelp_id": "yQdzlwWSfNDwj1WUixOMHA",
    "user_location": "Nashville, TN",
    "rating": 3,
    "review_date": "10/7/2015",
    "comments": "I came here and had the goat curry with rice and cabbage.The goat curry was so-so. To be honest, I felt like it lacked some spice or freshness. Something. The rice was also so-so. I love rice, so when rice doesn't taste fresh, I am not impressed with the rest.  I would probably give it a shot down the road, after I have tried all the other merchants at the Farmer's Market, but I voted this place a 3 due to inconsistency or my mediocre experience.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jessica A.",
    "yelp_id": "wG_rj0wUg950w7nyDmkozA",
    "user_location": "Denver, CO",
    "rating": 5,
    "review_date": "7/5/2016",
    "comments": "Delicious food and a very nice staff! First time trying Jamaican food and I will most definitely be back!!! I recommend the mild boneless jerk chicken. Best EVER!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Alexandra F.",
    "yelp_id": "qVEOVvc9gB29v7IAWsnA_g",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "11/5/2014",
    "comments": "WOW. I don't even know where to begin. I went here for lunch and I was the only one in the building. The atmosphere here is cool. Awesome music and definitely somewhere cool to have a date or nice dinner.Peach tea to start me off was great. I also noticed they have natural fruit juice. Can't wait to try those another time. I order the spicy jerk chicken with yellow rice and plantains. She also brought me out some extra spicy sauce. I have no idea what exactly it was made from, but it was tasty. I have no idea how I ate all of this food. I went for lunch, but it was actually technically dinner so the portions were bigger. My eyes lit up when the food came out. I dove right into the chicken, dismantling it in search of juicy white meat. The server had asked me if I preferred light or dark meat. I said light and that's exactly what I got! I HATE pulling meat off bones, but this was SO WORTH IT.The meat was so tender it pulled right off. The yellow rice was SO GOOD. She had told me it was jasmine rice. I love it. I had never had that before. Mind you this is my first time eating Jamaican food. The plantains were the best I've ever had. I would grab chicken, sauce, a little rice. Have a bite. Eat a plantain. Repeat. Everything tasted so good. Another peach tea and I was finished. Jamaicaheaven seems like a more appropriate name. Maybe they'll consider changing it.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Marta P.",
    "yelp_id": "-zHwZAsWzqHziyZ2MvqyDA",
    "user_location": "Atlanta, GA",
    "rating": 4,
    "review_date": "1/8/2016",
    "comments": "Delicious! Jamaicaway has everything you need on a chilly day in Nashville. You definitely won't leave hungry! I went with 3 other people to explore the Nashville Farmer's Market with a mission to eat some Jamaican food. It was suggest by the vegan in our group and she was super excited to try something delicious. Right away the smell of jerk seasonings pulls you in. The restaurant is tucked in the back corner of the farmer's market towards the doors for the outdoor flea market. The menu is expansive allowing everyone to try different things. I got the dark meat curry chicken with plantains and Jamaican rice. They offered to put extra sauce on the rice (YES PLEASE). Super cheap at $7.75. My boyfriend got the goat roti with plantains. HUGE portion which he was excited about. They were running low on plantains so they fried up a fresh batch and gave him extra, which was very kind. I believe his roti was about $10.The seating is cafeteria-style booths with hot sauces on every table. I appreciate that because I could add the extra kick I needed to my plate. Chicken - 5 stars. Super flavorful. Rich, DEEP flavor in the chicken from sitting in that curry. The plantains are always amazing, and the rice was the perfect side to sop up that leftover sauce. I ATE EVERY BITE. You can't go wrong here. Everything is good, and the ladies behind the counter are very helpful and have a smile on their faces.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Brett B.",
    "yelp_id": "u365CCgqhf2JtN4fhOPV1g",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "7/12/2015",
    "comments": "Met family there for a Sunday lunch had the Curry Goat in a green curry sauce fall off the bone tender with steamed cabbage and yellow rice, all together we had 3 meals meat 2 veg and bottled water for under $20 can't beat that\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Robyn S.",
    "yelp_id": "bph_3NmmPMojX5oq4H38cg",
    "user_location": "Antioch, TN",
    "rating": 4,
    "review_date": "8/1/2016",
    "comments": "My go to for Jamaican food. I've had the spicy and mild Jerk Chicken, as well as the Oxtails. My fave is the spicy Chicken, can't go wrong when ordering.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jonas S.",
    "yelp_id": "MDQ9mbtXGHzqS5nbvEm5pw",
    "user_location": "Clarksville, TN",
    "rating": 5,
    "review_date": "5/24/2015",
    "comments": "The food was fresh, hot and delicious. I loved it. A great taste of the Caribbean. If you're in Nashville passing through or visiting, I highly recommend this place.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Travis M.",
    "yelp_id": "ZX84Tq843zXzQpTAqCpvug",
    "user_location": "Brentwood, TN",
    "rating": 5,
    "review_date": "1/14/2016",
    "comments": "Great food! Try the fried plantains for a touch of sweet starch with your spicy jerk.  If you want something a little different, try the Jamaican tea in the drink fountain; I still can't quite place the flavors.  However, don't expect it to be quick during mid-day. The lunch rush gets busy.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Sandra P.",
    "yelp_id": "F-qcp4r547z3FfPnb2_AxQ",
    "user_location": "Portland, ME",
    "rating": 5,
    "review_date": "1/23/2016",
    "comments": "The best food in Nashville. A wide veggie selection. Spiced perfectly. Friendly and speedy service.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Annie L.",
    "yelp_id": "ms7gg62p6gEfc6-YHNaebQ",
    "user_location": "Atlanta, GA",
    "rating": 2,
    "review_date": "7/10/2014",
    "comments": "I visited here upon seeing it on DDD (diners, drive-in, and dives) on Food Network. I don't always follow the Food Network trail, but I remembered this restaurant in particular was in Nashville, and we were headed to Nashville for the Fourth of July holiday weekend sooooo why not give it a try? After having Jamaican food in Athens, GA at Kelly's Jamaican Foods---I've been addicted to that jerk chicken.Jamaicaway food is good, but not amazing. It's a bit overpriced in my opinion. I got the jerk chicken which was NOT spicy but was moist for the white meat. Cabbage lacked flavor. And the corn bread was extremely dry. It was good to dip in the jerk chicken sauce though. I did try the Johnny roll and wish I had ordered that over the cornbread. Butttttt I gotta stay true to my stomach. If you are truly looking for good jerk chicken that's spicy and full of flavor, bomb dot comb cabbage, and amazing cornbread---next time you are in GEORGIA try visiting Kelly's Jamaican Foods. YOU WONT REGRET IT. Jamiacaway is no comparison.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jennifer H.",
    "yelp_id": "If3gcdkHLIeDKJV-2qzS5Q",
    "user_location": "Murfreesboro, TN",
    "rating": 5,
    "review_date": "5/17/2015",
    "comments": "The food reminded me the time when my friend and I went to Jamaica. Although I never had Jamaican ox tail, the adventure side of me tells me I should give it a try. Well I'm glad that I did. The ox tail was tender and nicely seasoned. My boyfriend had spicy jerk chicken, even though it's not spicy, he enjoys the dish. Their side dishes were excellent too. I had the steam cabbage w Jamaican rice. Not only they have delicious food, the have wide range of drinks from Jamaica. We had the carrot mango and tropical fruit punch. The juices are very good, not too sweet. The overall atmosphere, is very relaxing and the staffs are very friendly. They serve you w a smile and help you with whatever you need.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jeffrey B.",
    "yelp_id": "Rlh6pYKEIp85npIsZkrlZA",
    "user_location": "Oak Ridge, TN",
    "rating": 5,
    "review_date": "5/31/2014",
    "comments": "Visited Jamaicaway in the Farmer's Market near downtown Nashville earlier this week for lunch with my girlfriend while I was in town for work. It was our first experience there, and honestly my first taste of true Jamaican food. Man, was I impressed!I'm a pretty adventurous eater, so I opted for the Curried Goat (with greens and yellow rice) - so not only was it my first taste of Jamaican, it was also my first taste of goat. SO GOOD!! Tender and savory. My girlfriend got the Curried Chicken with yellow rice and pineappled sweet potatoes, and she loved her meal as well. The prices were decent - I think we paid around $20 for the both of us. Overall, it was a fantastic meal that I'll be looking forward to experiencing again when I'm back in town!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Tanya H.",
    "yelp_id": "vzGqArcHFuUINVEu_HibxA",
    "user_location": "Hollywood, FL",
    "rating": 3,
    "review_date": "11/30/2014",
    "comments": "Jerk gluten was a little to spicy, even eating it with my Johnny cake it was still to spicy, plantains and sweet potato was good. Herbal peach tea was great!\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Ashley T.",
    "yelp_id": "CMO04SMgjqiI_kF3FrswTg",
    "user_location": "Knoxville, TN",
    "rating": 5,
    "review_date": "12/22/2014",
    "comments": "Where do I even start?! Stopped by around 4:40pm today to grab some food to go (they close at 5). I've had JW bookmarked for a while now based on good reviews and a sheer curiosity of never having had Jamaican food before. The guy working was so friendly and let me try every vegetarian entree they had out. OMG. I seriously had the toughest time choosing just one! I tried the spicy jerk soy, bbq soy, curry tofu, and another soy dish that tasted coconut-y. All SO good. I chose the spicy jerk soy, steamed cabbage, and he was nice enough to make me fried plantains. He told me the Jonny cakes were gone for the day but gave me cornbread and told me to ask for the Jonny cake next time. Literally everything was full of flavor and delicious. Spicy jerk soy was spicy but not too spicy. And for a decent sized portion of food, it only set me back $8.65 before tip. I will definitely be back (maybe tomorrow, sue me) to try other sides (which he said were all vegan -excluding the cheesy mashed potatoes I'm assuming), chow down on a full portion of another veggie entree, and try the Jonny cake. Friendly service, great food, reasonable prices!\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Christina D.",
    "yelp_id": "gebEX1L3FbFdA9Mn0PttXw",
    "user_location": "Knoxville, TN",
    "rating": 5,
    "review_date": "2/18/2015",
    "comments": "So amazingly good! They even allow you to try anything before you order it!  So many vegetarian options and delicious sides. I couldn't be more excited to eat here again. Don't let this farmers market restaurant fool you, it's authentic and fresh! You know it's good when the workers are Jamaican! Love the different sodas and desserts too!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Tresa P.",
    "yelp_id": "0Wlnr14PnxLEUQX-Tt4USg",
    "user_location": "Marietta, GA",
    "rating": 1,
    "review_date": "5/28/2015",
    "comments": "Very subpar food. The rice and peas were bland. The cabbage was just okay. The sauce on the oxtails was terrible. I literally scowled when I took the first bite. I had to wipe it off with a napkin in order to eat them. Several of the bones were just fat and no meat. I was very disappointed since I was really craving good Jamaican food. Maybe that doesn't exist in Nashville. I wouldn't come back and wouldn't recommend it, I wasted $13 and a cheat meal. The music was good and the service wasn't much to write home about either. Try again Jamaicaway.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Khoi T.",
    "yelp_id": "szGhCr_iYJbwJDyplMHzoQ",
    "user_location": "Burkburnett, TX",
    "rating": 3,
    "review_date": "10/29/2015",
    "comments": "We were in the mood for Jamaican so we decided to stop by this small, but down home place inside the Farmers Market. We both had the spicy jerked chicken, and it was good (even though I would like it to be a bit spicier). It might not be the best jerked chicken that I've eaten, but it's good. I also ordered an extra side of ox tail, and it was decent. I would say that it's a good place to visit if you're around the area and want to try something different.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Sandy W.",
    "yelp_id": "Sb70BQufhpjlzY0t9VDgWA",
    "user_location": "Los Angeles, CA",
    "rating": 5,
    "review_date": "10/3/2013",
    "comments": "Prepare to loosen your belt a notch. And make a sequel to your first visit soon after. This buffet style layout has so many hearty, unique flavors and too many dishes to try in one meal. They have jerk chicken, of course, but the total variety of other flavors will expand your palate for sure. There are a ton of veg options too (the curry tofu, jerk seitan, and polite sticks are all vegan). But they have collard greens, cornbread, Johnny cakes, curried goat, mango chicken, etc. to fit any craving. I like the assortment of actual Jamaican beverages too. The owners and workers are helpful with any questions you have to help you decide. You can complete your meal with carrot or lemon cake, or a packaged offering from Kahn's Desserts -which I couldn't refuse. I love coming here, slightly over-eating, and then walking it off around the farmer's market :D\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Casey H.",
    "yelp_id": "WSptrgW8NLFBNvw1FOpifw",
    "user_location": "Scottsdale, AZ",
    "rating": 2,
    "review_date": "8/27/2013",
    "comments": "I've wanted to try Jamaicaway since the day I started work in the Metro Center almost 2 years ago but for some reason, I've had an excuse for not going. Well, I finally went yesterday because one of my friends wanted to go to the FM for lunch. I had the brown gravy chicken and rice/beans and plantains. The chicken was waaaaayyyy overcooked - extra dry. The rice and plantains were okay at best. Nothing special.... The meal came out to about $8 with a free glass of water which is comparable to other meals at the FM.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Meg D.",
    "yelp_id": "9yHqe65dsNE2-OwEm58-2Q",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "12/23/2014",
    "comments": "Located in the Nashville Farmer's Market, Jamaica Way is definitely a place not to be missed.Upon walking in, your first task is to read the large menu on the wall, try not to drool and pick up a tray. To be honest, don't bother with the menu on your first trip. Wait in line with your tray and choose a meat and two sides once you get to the counter. The employees are very friendly and helpful... They'll be more than happy to answer any questions you may have!Good go to's for first timers:Jerk chickenFried plantains or cheese potatoes Collards or turnip greensJohnny cakeThe curried goat and ox tails are also fantastic choices for a meat.Jamaica Way is such a a delicious and consistently yummy place for lunch. If you are looking for something different, but still has a hint of comfort food, Jamaica Way will not disappoint!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Larry S.",
    "yelp_id": "9TuUABNmDhBqdDael0zy8w",
    "user_location": "Hendersonville, TN",
    "rating": 4,
    "review_date": "8/16/2013",
    "comments": "I've never tried Jamaican food before, but I've been wanting to try this place since seeing it on Triple D.  I'm so happy we finally got to try it.My wife and I both tried the Jerk Chicken.  She really enjoyed the mild and I loved the way the spicy woke up my taste buds.  Even though I got full, I left already planning my next meal when we come back.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Christie W.",
    "yelp_id": "Fglro06bjhIj_J2vcmN5aA",
    "user_location": "New Berlin, WI",
    "rating": 5,
    "review_date": "4/4/2016",
    "comments": "This place was recommended by friends of ours while we were visiting Nashville and I cannot say how GLAD I am they recommended it! I got a small plate of the spicy jerk white chicken with collard greens and Jamaican Rice and it was AWESOME! Portions were huge, price was low, and the food was great. I highly recommend you check them out...I was pleasantly surprised!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Danny N.",
    "yelp_id": "Jl4kC3eiGlEgEylXpOj7-Q",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "10/22/2014",
    "comments": "I popped in last minute as the Greek place was closed earlier than expected.  The girl behind the count was very friendly.  I got the curry goat, greens, and red beans and rice.  They have me a ton of red beans and rice and a good portion of the others.  The greens and rice were tasty.  The curry goat was fantastic.  I'll be back to try some other options as well.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Janette C.",
    "yelp_id": "9XkpizE6dAqTmnyQ_eKLfA",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "8/5/2013",
    "comments": "So many choices and so many GOOD food options in here!    We were driving around looking for a place to eat lunch and I suggested here.  It had been a couple years since I had been and my fiance had never tried it.   He's always looking for new and spicy things to try!We ordered a variety of items to try and we were not disappointed!  It was ALL very good and we were able to get it fast and get seated immediately.    If you have a lunch break and are concerned about time, don't be!  They are quick!  You can get it to eat in or to go.  Very good food and reasonably priced!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "M M.",
    "yelp_id": "gD0avWOkQ54aR4N721b9dw",
    "user_location": "Winston, GA",
    "rating": 5,
    "review_date": "9/28/2015",
    "comments": "We decided on this restaurant for the many vegetarian choices and were not disappointed. I had spicy jerk soy. It was delicious and just spicy enough to not overpower the flavors. The Jamaican rice was a nice compliment to the jerk soy. My husband got a spinach and cheese pie that had a light and flaky crust and a well-seasoned filling. We both had plantains-cooked to a perfect tenderness and sweetness. The Johnny cakes are a fried delight and the pineapple ginger juice is so dreamy. The staff was very friendly as well.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Robert D.",
    "yelp_id": "wRWQxLwF6JzfOAcpjzKEZA",
    "user_location": "Hermitage, TN",
    "rating": 5,
    "review_date": "6/25/2015",
    "comments": "I think this place is a terrific lunch option in the farmer's market. My curry chicken was cooked to perfection: fall off the bone, yet still moist. It paired beautifully with my cheesy mashed potatoes, greens and johnny cake, all (with drink) for just over $10. I will definitely be back.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Celeste S.",
    "yelp_id": "wx5luls9K5fdSVxmVAAa2g",
    "user_location": "Chicago, IL",
    "rating": 4,
    "review_date": "8/2/2015",
    "comments": "Everything was fabulous! I had the mild jerk chicken, green beans, mashed potatoes,  beef patty, and herbal tea.... All of that for just $11! The customer device was great also. Really great place to grab some excellent food!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Sharon K.",
    "yelp_id": "rRdhtqePilOUbSjIJz-h-w",
    "user_location": "Independence, OH",
    "rating": 3,
    "review_date": "9/6/2014",
    "comments": "I finally found this place on Yelp! I saved a business card I got from here. I was here 4 years ago. Back then I donated some money and got a meal that way. It was pretty good. :) Sweetest owner ever. Not too spicy.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Marine A.",
    "yelp_id": "bar6K44Elub07JG_fpqd8Q",
    "user_location": "Buffalo, NY",
    "rating": 4,
    "review_date": "4/21/2014",
    "comments": "The Good: covering all bases, from jerk chicken to pork BBQ. Same with the sides: red rice to collard greens. Obviously all very tasty. Good deals, about 8 - 12$ for a meat, two sides AND a Johnny roll ( Jamaican beignet if you will ). Fun foods: goat ragu, fried plantains, ox tail.  Better know what you want, quick service by some friendly employees. The Bad: Boring ambiance, booths could use a makeover. Gotta pay for tap water boooo. Bottom line: Guy fiery came and conquered, you should too.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Park R.",
    "yelp_id": "e4i0rK0FIZKKB6SbGkukaA",
    "user_location": "Louisville, KY",
    "rating": 5,
    "review_date": "6/27/2016",
    "comments": "okay i told my girlfriend that the nexttime i am in nashville i had to try this place and might i say dont pass this place up i got the peas and rice and jerk chicken and the stewed chicken and sweet plantains and the stewed chicken was the best this place will not disappoint\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Tony D.",
    "yelp_id": "H7pj7sbXY3N-WSEwa-JfpA",
    "user_location": "Pittsburgh, PA",
    "rating": 3,
    "review_date": "6/19/2014",
    "comments": "While this place has a bunch of nice tables for eating in, it also caters well to the to-go crowd. Got the mild jerk chicken with fried plantains and sweet potatoes, along with a herbal tea drink. I'm not experienced with Jamaican fare, but I personally thought the chicken was okay at best; it was a bit drowned in sauce and too bony for my tastes. The plantains were pretty good though, and both the peach and raspberry herbal tea had an interesting flavor (pretty different from just sweet tea).\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Trevor C.",
    "yelp_id": "eY9IYz5KOdb__j05jBnACg",
    "user_location": "Alpharetta, GA",
    "rating": 5,
    "review_date": "4/21/2015",
    "comments": "Great food with vegetarian and vegan options. Great customer service. The food is very very fresh and different. Great find in Nashville. Filling and a unique experience.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Nakia H.",
    "yelp_id": "819ojDXHkpH6vbkprzAhBQ",
    "user_location": "Spring Hill, TN",
    "rating": 1,
    "review_date": "6/13/2015",
    "comments": "Not as good as what was discribed on tripleD. The best thing was the peach tea and the meat patties.  I had the spicy meat patty and it was good.  The chicken was all stewed instead of just baked like I expected.  The coconut drop had a weird consistency.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Amber L.",
    "yelp_id": "OLswYLnI8GVgeeRuXLc-Fw",
    "user_location": "Alameda, CA",
    "rating": 4,
    "review_date": "7/20/2012",
    "comments": "This place is yuuuuummy. Authentic Jamaican food - something I have not found in the state of Arkansas (where I live). It's nestled inside the Food Court near the Nashville Farmer's Market. In fact, I was impressed overall with the selection of food options here (Mediterranean, French, Indian, American, they have it all!)Despite the kitchen being somewhat chaotic (they ran out of plantains and were scrambling for more), the staff was friendly and apologetic for the chaos. We ordered the jerk chicken with sides of cheesy mashed potatoes, fried plantains, rice and peas, and a johnny cake. The jerk chicken was DELICIOUS - truly awesome flavoring! Everything was just superb, really. Highly recommended!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Nickie G.",
    "yelp_id": "L27OShvycGmVOkAxD1h86A",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "1/20/2012",
    "comments": "I finally tried Jamaicaway at the Farmers Market a few weeks ago and can't figure out why it took me so long.When you come in you get in line and order from the people by the counter.  The food is out like a cafeteria line so you pick your meat and sides and they hand it to you.  Don't forget your tray and silverware or you'll have to push through the crowd and get it later.  Ooops.I tried the spicy jerk chicken with fried plantains and greens.  God I love greens and they were great.  the jerk chicken was spicy but not too spicy and was tasty.  Watch out though because there's some weird gristly/chewy parts in there.  Fried plantains were perfect - I don't get a lot of opportunities to eat plantains so I had to have them.  The Johnny cakes soaked up all the tasty sauce from the jerk chicken and made me full and stuffed.Good place to eat lunch when you are at the Farmers Market - just be prepared to be uber-stuffed and needing a nap afterwards!\n        Was this review …?\n    ",
    "votes_useful": 6,
    "votes_funny": 2,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Huyen T.",
    "yelp_id": "KdKbpCWHuARXgnAp-o8Ukg",
    "user_location": "Memphis, TN",
    "rating": 2,
    "review_date": "3/18/2014",
    "comments": "Not sure if it's because this is the only Jamaican restaurant in Nashville...but the food was way overpriced and it wasn't all that special to be honest. It was my first time trying Jamaican food, but I went with another friend (who had Jamaican food in FL) and she said that she had better and it was much cheaper. I've had food from Trinidad, islander food, and  I have to agree...it could've been better for what I paid for. So meh, I will not be coming back.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Mitchell S.",
    "yelp_id": "Z-aTFbv3w5GR0iv28l4Qfg",
    "user_location": "Mechanicsville, VA",
    "rating": 1,
    "review_date": "2/3/2014",
    "comments": "Decided the night before to take a group of friends here. We planned our day around a trip to Jamaicaway. I never once thought I would need to call and see if this place was open on a Saturday...A SATURDAY.  They're located at a Farmer's Market...why are they closed on a Saturday?I am sure they're food is good but I'll never know. I live 600 miles away.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 4,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Sid N.",
    "yelp_id": "tGqHZWmsMwk_kLqtadWJ3w",
    "user_location": "Jacksonville, FL",
    "rating": 5,
    "review_date": "1/19/2015",
    "comments": "If you're in the mood for a little sweet and spicy, head on over to Jamaicaway. The coconut delight, curry chicken and spicy jerk chicken are delicious. You must get the Jonny cakes! Most of the entrees are under $10 so it's very affordable.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Michelle P.",
    "yelp_id": "4UGOVDfCe5ULzc1q5pgU9g",
    "user_location": "Nashville, TN",
    "rating": 3,
    "review_date": "4/9/2014",
    "comments": "Food was very tasty and portion was nice. I ordered the medium Jerk chicken and it was EXTREMELY tender and flavorful. Johnny cake was good, I wish I would have  saved it to soak the juices up off my plate when I finished but it didn't last that long! Service was so so, they sort of seemed understaffed but all in all a good place to eat if you are in the area. I wouldn't drive out of my way for it but would prob eat here again.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Fr J.",
    "yelp_id": "Oq32Gfr7a55ZuAdCl8w8oQ",
    "user_location": "Nashville, TN",
    "rating": 2,
    "review_date": "3/23/2014",
    "comments": "Well I was disappointed this time..I got the Oxtail.. well since I never had it before it is hard for me to compare it with it in the past... I didn't like it.. It was to difficult to eat.... tasted like old beef stew and was over priced.. the corn bread tasted and smelt old.. This review is a whole lot different than the first time I ate here..  that time it was a great experience. . I am not sure if I will be giving this another chance..\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jason N.",
    "yelp_id": "cBwNJaWva-N6U71lhMS2GA",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "1/1/2015",
    "comments": "Went here a fews weeks ago! Really enjoyed the food . Great customer service and friendly environment. Every Time  I go I get great service I will always recommend this spot.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Dani W.",
    "yelp_id": "Y0lLBYJ4NuZ4lM363mmAtA",
    "user_location": "Antioch, TN",
    "rating": 4,
    "review_date": "12/14/2013",
    "comments": "I ate here for the second time yesterday. I love it! My first visit I ordered the ox tails with yellow rice and cabbage. Yesterday I had mild jerk chicken, cabbage, plantains, with a Johnny cake. Even though the food was good, they we skimpy with the portions of my sides. For almost 10 bucks I expected a little more. I also had to ask for the Johnny cake which came with the meal. If I hadn't asked I wouldn't have gotten it like the first time I visited. I will probably eat here again. I like trying different food and they have a large selection on their menu.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Elizabeth B.",
    "yelp_id": "woEX-UPJAzxYM88cjBfktQ",
    "user_location": "Murfreesboro, TN",
    "rating": 5,
    "review_date": "1/19/2013",
    "comments": "This is my favorite spot to have lunch in Nashville. First of all, the owners are of the nicest people I've ever met in my life. The wife is a former school teacher and always  finds something interesting to talk about. Even when the owners are gone, the other employees are fun too. They are all about having a good time and crank up the music while they work. Now for the important stuff! FOOD. Every time I visit, I always pour myself a giant glass of raspberry iced tea. It's almost a little too sweet, so I typically cut it with a tad I water (the sweetness adds to the charm though). My favorite dish here is the mild jerk chicken. So fresh and tender...it just melts in your mouth. This meat option pairs very nicely with collards, fried plantain (a must!) and a \"johnny cake\" (basically an unsweetened donut). This meal is so rich that you might pause midway and wonder if you should save the rest for later. Do not. Enjoy it while it's fresh and delicious. They also offer exciting other proteins like oxtail, goat (also delicious and happens to be the owners personal favorite), soy, and gluten. I've never tried oxtail. But I love the fact that I have the option of eating it at some point. This place is a vacation in your mouth. If you are stuck in a food rut, COME HERE.\n        Was this review …?\n    ",
    "votes_useful": 7,
    "votes_funny": 0,
    "votes_cool": 4
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Ying M.",
    "yelp_id": "B3_7wesLdWxEH07WrXNaKw",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "8/11/2014",
    "comments": "My first experience with Jamaciaway was pretty great and I'm looking forward to trying it out again. I enjoyed a plate of goat curry, collard greens, and mashed potatoes, along with some delicious cornbread (alas they were out of johnnycakes when I went through the line). The goat was a little heavy for me, but then again it's goat. Sides were good- a little on the salty side, but that's par for the course with any meat and three (or two) in town. It was nice to see so many vegetarian options available, although I don't expect I'll be taking advantage of them any time soon- next time I go I'll be wolfing down a plate of jerk chicken.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Mel V.",
    "yelp_id": "flj6NjfxqwudsBvOTbrhug",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "10/14/2012",
    "comments": "Nom, nom, nom, nom! I don't often make down to this Farmers Market anymore as I get the items I need at the the one in 37206. But when I do make it, I'm always pleasantly surprised! The Family and I stopped in here for lunch after running around town and we left full and satisfied. I picked the mild jerk chicken, rice and peas, and the sweet potatoes. My husband got a half an half of brown chicken and spicy jerk, greens and rice and pea. Our 2 year old loved his yellow rice and chickpea fritters. and we all shared 2 varieties of patties. That's a lot of food, I know, but we ate it all. ALL... Sopped it all up with a Johnny cake. Do yourself a favor, come on in during your lunch break and grab a bite, you won't be disappointed. It's all fresh, and it's all delish.\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jeff K.",
    "yelp_id": "orcq1sBl1HPVM8VbQ59RCg",
    "user_location": "Orlando, FL",
    "rating": 4,
    "review_date": "10/14/2012",
    "comments": "Love the jerk chicken! A great selection of jamaican sodas as well. I tried the herbal raspberry drink and it was delicious!They lose a star because I never recieved my johnny's(sp?) that were supposed to come with our meal!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jeremy E.",
    "yelp_id": "UgFW_QEhfFmzXjO2bZc5nA",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "3/27/2012",
    "comments": "Spicy. Jerk. Chicken.I am tempted to leave the review at that, but there are a few other highlights I have to mention. So the Spicy Jerk Chicken is out of this world. Perfectly seasoned, perfect heat, perfect texture. Just amazing. I got it with their cabbage, and I have never enjoyed cabbage so much. Also a great texture change from the tender chicken and fluffy rice and peas. The fried biscuits are unique and freaking delicious. I love this place.\n        Was this review …?\n    ",
    "votes_useful": 4,
    "votes_funny": 0,
    "votes_cool": 2
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Emma W.",
    "yelp_id": "uEj2T7mK69joQWSa7y3iGA",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "7/27/2014",
    "comments": "I have been wanting to try this place out forever. Finally got to try it today and let's just say i meant to take half of it home, but I just couldn't stop eating. I got the tofu curry, fried plantains, and a side salad, which was all vegan. I want to bathe in the tofu curry broth. It's the perfect combination of curry and coconut milk. My boyfriend got spicy fried chicken, greens, and rice. He loved his as well. Prices were definitely fair. They also sell khans vegan desserts here! The music is authentic and creates a fun atmosphere. I will definitely be back!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Kimble B.",
    "yelp_id": "-67fgF0RULJpR6HE-LxLRw",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "3/5/2012",
    "comments": "Years ago, when we lived in rockville, MD, we swore there was no better carribean restaurant north of Jamaica than Carribean Feast. Today in Nashville, we are so lucky to have a new favorite - Jamaicaway. The johnny cakes bring me back to the islands. They are the perfect compliment to an unrivaled spicy jerk chicken (my favorite) or tender oxtail that falls from the bone. Surprising, the appetizers are half thr reason I keep coming back. The cabbage is perfect every time and the greens are just right, not too sweet. Come for the food, come back again and again for the service.\n        Was this review …?\n    ",
    "votes_useful": 4,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Pratima N.",
    "yelp_id": "r6HeydnoDH2R6AvqHYQnwA",
    "user_location": "Columbus, OH",
    "rating": 5,
    "review_date": "5/22/2015",
    "comments": "First time trying Jamaican food during our Nashville trip and was pleasantly surprised. The serving portions were great here and the goat was cooked to perfection, fall off the bone, melt in your mouth type. The spicy jerk chicken was no exception. And the johnny cakes were a bonus. The sides were pretty delicious. Service was fast and some were friendly and open to questions but others a little harried.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "L Dante G.",
    "yelp_id": "pr5IFnsmG7jePwJzP3k_yw",
    "user_location": "San Ramon, CA",
    "rating": 5,
    "review_date": "4/29/2012",
    "comments": "I love Jamaican food. A little known fact about my hometown (Toronto) is that it has the 2nd biggest West Indian population outside of the West Indies next to Brooklyn, NY. I grew up around Jamaican food and culture.  Imagine my excitement when I found this joint at the farmers market!As far as Jamaican food goes this joint is spot on. It's a for real Jamaican joint after all. The jerk chicken, oxtail, curry goat, curry chicken (all with rice & peas and callaloo) are the dishes I generally go for with a jamaican beef patty on the side.  Go for the kola champagne or a bottle of ting an you'll be good to go.Another joy was the fact that they have roti, which is a West Indian flat bread like tortillas but in my opinion is way better. It's got crushed chick peas and is as good as it gets. As for the beef patties, they're good, but not as hot (spicy) as I like to have them, but being in Nashville with only one other West Indian joint, I won't complain.Tell the good dude Kamal that eyejammy says \"what up.\" I highly recommend Jamaicaway. Likkle more. seen!\n        Was this review …?\n    ",
    "votes_useful": 4,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "LaTamera W.",
    "yelp_id": "-nmTwBe8ITqGPNoImxWCLg",
    "user_location": "Hermitage, TN",
    "rating": 4,
    "review_date": "5/29/2012",
    "comments": "Food is great. Variety is essential in everyday life. Love their jerk chicken patties! Love their plantain and sweet potatoes with pineapple.  Pricey place but understandable based on their location and the variety of food they serve.  This is a great spot for oxtails, greens, vegetarian meals, and Jamaican grub.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Janet S.",
    "yelp_id": "SXeMGP5lNgc03z7cl9Xihg",
    "user_location": "Nashville, TN",
    "rating": 3,
    "review_date": "10/19/2011",
    "comments": "Tucked away in the Farmer's market, buffet style, jerk chicken, curry chicken, beef tips, goat everything, top it off with some yummy callaloo and cabbage or a bit of sweet potato casserole and a portion is more than enough for two. Add s portion of the best Roti in town, drown it down with ginger beer and you'll be asleep before you get back to work.Food is a little salty but that's how it should be I think!Oh and did I say super nice people.  Snaps for small businesses as Elle Woods would say.\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 1,
    "votes_cool": 2
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Ben W.",
    "yelp_id": "2yXUqi7GClFyBbagVunI4w",
    "user_location": "Orange Park, FL",
    "rating": 4,
    "review_date": "5/2/2014",
    "comments": "I am a cook.  This is as good or better than I do at home. Amazing flavor for fast food steam line. Spicy jerk chicken very good. Sides all good.  Mild hot sauce and vinegar bottles on tables, but they need salt and pepper shakers. Very reasonable prices and friendly staff. Had all I could eat for around eleven dollars. Definitely one of the places to lunch in Nashville.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Sam P.",
    "yelp_id": "hlNq_paBNoG9TIzzayOGhA",
    "user_location": "Hermitage, TN",
    "rating": 5,
    "review_date": "2/17/2014",
    "comments": "First time experience today and was very impressed!  I was here with my partner who is originally from the Caribbean and he gave the stamp of approval lol We will be back regularly!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Tamoghna B.",
    "yelp_id": "VW0RCGyJJzAdk-3vWChE0w",
    "user_location": "Sunnyvale, CA",
    "rating": 5,
    "review_date": "10/11/2014",
    "comments": "This one definitely makes it to my personal top 10. It's a little gem tucked away in the farmer's market, a place that quite frankly, doesn't have a lot to boast of except for the food court which surprisingly offers a lot to choose from. My girlfriend couldn't stop talking about this Jamaican place that Guy Fieri stopped by. So we went. Like always, I asked the most solemn looking person in the staff what the one thing on his menu was that would bring me back to his restaurant and he instantly replied 'goat curry roti'. If you're getting one of their entrees, you get to choose 2 from an insane variety of sides. My girlfriend got the jerk chicken and  yellow rice and corn bread for her sides but I am told the steamed cabbage is worth trying as well. Grab a chicken patty (with warm coco bread, of course) to get that appetite working and a drink of their homemade sorrel and I promise you will hear Bob Marley 'stir it up' right inside your soul!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Marilee S.",
    "yelp_id": "LlcQGGCLjaJKqI_8buShAA",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "5/15/2011",
    "comments": "There is NO reason to go to Calypso Cafe. None if you're anywhere near this little gem tucked front and center at The Farmer's Market. Tender meats like jerk or curry chicken, goat or oxtail, or vegetarian options. Fresh vegetables like kale or orange sweet potatoes with chunks of pineapple cooked in rich seasonings and yummy sauces.  The staff is delightful, attentive and willing to wait as you decide and sample your options. Don't go if you're in a hurry and want a quick sandwich. There's other options. If you're not taking it to go, you are served on real, not paper, plates with real, not plastic, silverware.Oh yeah I'll be back. Every time I go to the Farmer's Market I'll be back.By the way, we met another customer who had them cater his birthday. The best, he said. People talked about the food for months.\n        Was this review …?\n    ",
    "votes_useful": 5,
    "votes_funny": 4,
    "votes_cool": 6
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Mike E.",
    "yelp_id": "6x68VGuqOV5jEzk8shBLuQ",
    "user_location": "Union City, NJ",
    "rating": 5,
    "review_date": "8/2/2011",
    "comments": "Wow. The food blew me away. I found this on Yelp and am totally happy I went. It's inside of a farmer's market. The service was a little slow cause they were understaffed, but the food made up for everything. I had the Mango Chicken and Spicy Jerk Chicken, both were amazing. If you are only visiting in town like I was, choose your sides carefully, as only 2 come with each plate (I ordered 3; Sweet Potatoes/Pineapple, Spicy Beef Patty, and Yellow Rice. The price was reasonable and the portion size was pretty decent. I can't wait to visit Nashville again so I can try the fish!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Piyush S.",
    "yelp_id": "X7X5gUCefTiSM2P8k207hQ",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "1/29/2012",
    "comments": "Wow wow wow. This is my kind of food, this is honest food, this is no bullshit food. Jamaican food is the quintissential fusion food. An almost perfect fuion of indian, african influence and I don't know what. We had the jerk chicken and the chicken stew and both were very juicy.I've gotta try the oxtail and goat next time. I mean, if you like this kind of food, you've got to come here. I have nothing more to write about it. I think as a foodie, a person who tries all kinds of cuisines, ethnic food, jamaicaway has to be the best nashville restaurant and for me it wins quite easily.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "B L.",
    "yelp_id": "NlILXETTpHK0fefgDaZuNg",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "11/4/2011",
    "comments": "Located within the Farmer's Market, Jamaicaway is a great lunch spot.They offer lunch specials which come with a meat, 2 sides, and bread for around $10-$12.  Their offerings are true to what I know of and have tasted of Jamaican cuisine, and they are done well.  The staff is courteous and friendly.I had the curry goat which was tender and well seasoned.  (I just want to put in a plug here for goat - you don't see it very often on menus here, but it is delicious!  I will never really consider myself a 'foodie' bc I do shy away from offal, but I would encourage anyone who is curious to give goat a try!)   For sides, I had plantains which were well fried - crunchy on the outside and soft on the inside, and callalou - which is a delicious green, very similar to spinach, but very hard to find in the states.  (if you ever see callalou soup on a menu, it is a must-try) When I inquired, the staff told me they have to get their callalou from Atlanta.   To complete the meal, I had a johnnie cake, which is essentially a tasty piece of fried dough.  This place makes me wish I was in the area for lunch more often.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Wayne H.",
    "yelp_id": "pDCNbptUg0L-AaWCS7U0Yw",
    "user_location": "Sunnyvale, CA",
    "rating": 4,
    "review_date": "6/26/2011",
    "comments": "Tucked away in the Farmer's Market, this place serves cheap, delicious Jamaican food.  By far their most popular item seems to be the chicken, which may come spicy, BBQ, or in jerk, curry brown sauce, or with mango chutney.  While the chicken dishes all seem to be chunks of chicken (with bone) immersed in their respective sauces, the meat is tender, and the sauces are deliciously thick, and strong, the brown sauce having a slight sweetness to it, while the spicy sauces have a fairly mild but respectable kick. Other dishes include a Tilapia escoveitch cooked while you wait that comes off quite tender and crumbly, if a little watery, and has a distinct sweet and sour-like sauce to it, as well as curried goat and ox-tails, which I have not gotten around to trying.  All dishes come two sides, which range from three varieties of rice (rice with beans, rice with peas, yellow rice) to fried plantains, various greens (from reallly bitter callaloo to thick turnip greens to green beans), and mashed or sweet potatoes.  A side dish of rice is nearly necessary to counteract the strong flavors of the chicken or fish.  All dishes also come with a choice of Johnny cake or corn bread, which also helps counteract the intense flavors. The Johnny cake comes nearly fresh out of the oven and is hot and crumbly like a very soft biscuit. With a drink, including various Caribbean sodas and  herbal fruit teas, it is just about $10-$15 for a good meal. The restaurant has somewhat odd hours, and is basically a glorified cafeteria. The staff however are friendly and helpful despite the bustle that surrounds them. Jamaicaway seems especially popular on Sundays after church and can get quite crowded at that point, though that is probably also the best time to visit.  Go early, like when it opens at around 11, to beat the crowds and get first dibs on the freshly made dishes. If you have not tried Jamaican food, I think this is a great place to start.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Hayley T.",
    "yelp_id": "aiwt9zMibEKJb03a8irGvA",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "7/30/2012",
    "comments": "I've been to Jamaicaway 4 times and I must say that I really like it. The first 2 times I got their Jerk Chicken because I love Jerk, but I was a little disappointed with the taste of it because I've had better Jerk Chicken from different places, but I guess different Jamaican restaurants have their way of making it.  But I did enjoy the Fried Chicken Mango Chutney!!  They give you 4 to 5 chicken fingers with sweet mango salsa, and It's really good. For sides I always get the rice and peas (red beans and rice)  the cheesy mash potatoes, and a Johny Cake. The Johny Cakes are so delicious, and they go well with Chicken Mango Chutney. For drinks I love their raspberry tea, it's so refreshing, they also have peach tea, which I'm not a huge fan of, I think it taste too sweet.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Catherine S.",
    "yelp_id": "bI0_3AJyk2CO0QTduCJq-w",
    "user_location": "Louisville, KY",
    "rating": 4,
    "review_date": "1/21/2011",
    "comments": "This place was great! The goat curry and jerk chicken are awesome... although the jerk chicken is different from what I'm used to. The people serving the food in the line are so friendly... I'd go back just to hang out with them! They also play good music! The tea is really really really sweet! If you water it down... it's good. Definitely check it out though... the food is a bit heavy, but it's pretty delightful.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Yao Z.",
    "yelp_id": "Adzb5v6YpltZ7HmeOzQARg",
    "user_location": "Elk Grove, CA",
    "rating": 4,
    "review_date": "12/7/2011",
    "comments": "Found this place on yelp while traveling for work. Couple co-workers and myself decided to give this place a try.The flavor of the food is unique and very very flavorful. We shared 4 different dishes and all of them turnout to be great. Because the herbs and spices are so unique so this place might not be for everyone. However if you are an adventurous foodie and always seeking exotic taste and great dining experience this is definitely the place to try. Later.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Megan M.",
    "yelp_id": "SChXFrsehSsO2O-_l1Cq8w",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "6/9/2011",
    "comments": "So, I only went here for my first visit today, and I'm not an expert on Jamaican cuisine, but from my first experience I give them five gold stars, with smiley faces even! I had the talapia escoveith w/ greens, cheesy mashed potatoes, and johnny cake.  Everything was so flavorful and delicious, and the rest of the food looks so good I know I'll be going back soon to try more.  They have hot sauces on the counter if you're crazy like me and can only eat food that's spicy.  The jonny cake, which is one of the bread options, would make Dr. Atkins roll over in his grave.  It's such a doughy goodness, I felt like I was committing a huge sin with each bite, yet it was so good I didn't care all that much.Located in the Farmer's Market, they are a little apart from the rest of the eateries so it's not hard to miss.  Also note they're closed on Saturdays.  The decor is modest and cheerful and there was just enough seating when I was there.  On the wall is evidence of Guy Fieri from Food Network visiting here, which is what made me aware of this place to begin with.  For my lunch entree, all of which come with two sides, I paid a little over $9 (chicken and veggies are a little less than fish).  Considering that is for something I can't get everywhere in Nashville and the food was delicious, I'd say that's a pretty good deal!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "cin f.",
    "yelp_id": "uXiE1Li0P_MLkG8fU1UNLA",
    "user_location": "Memphis, TN",
    "rating": 4,
    "review_date": "11/1/2012",
    "comments": "saw them on diners, drive-ins and dives and wanted to try the food. you can go down the cafeteria style line and get a plateful of delicious food. i had the mango chutney chicken. it did not disappoint. it was crunchy and flavorful.  my hubby had the the tilapia escovitch which was absolutely fabulous. next time we go back, we will try the goat and/or oxtails.  the johnny cakes are okay.  the fried plantains were a little soggy.  the raspberry and peach teas were refreshing.  they have several  items on the menu that cater to vegetarians. makes me wish we lived a little closer. also, the place is conveniently located near the farmer's market. so you can eat and then walk around.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Josh M.",
    "yelp_id": "WYSUqHnFldL4XM7vVYVMAg",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "9/12/2011",
    "comments": "After I was ditched for lunch by multiple friends, I decided to go solo to Jamaicaway. Solid decision on my part. I went with the Mild Jerk Chicken, pineapple Sweet potatoes, and Cabbage. When asked whether I would like Cornbread or Jonny Cake, I went with the Jonny Cake.Everything was great, but the Jonny Cake really resonated with me. It's basically a doughnut, without icing, and without a hole. Everyone was friendly, which makes every meal better. Try it!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Ed H.",
    "yelp_id": "6L7Gub0zf5-kuUbFbZ28wg",
    "user_location": "Smyrna, TN",
    "rating": 4,
    "review_date": "3/11/2014",
    "comments": "Was skeptical at first being this restaurant is within the Farmers a Market but I was pleasantly surprised.  While I'm not an expert of Jamaican food, I can say without a doubt this was the best I have tasted.  Definitely a place to visit.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Dawn L.",
    "yelp_id": "JUETBHOWcIe9wpYdhF1Oxg",
    "user_location": "Loveland, OH",
    "rating": 5,
    "review_date": "7/31/2014",
    "comments": "Ah. Jamaicaway. One of my favorite restaurants in Nashville. When I want my caribbean fix, this is my spot. In addition to staples such as oxtail, jerk chicken, meat & veggie patties and rice & peas, Jamaicaway offers vegetarian options. I've tried the vegetarian dishes and they are quite tasty. So if meat isn't on your list, you have options. The jerk chicken is my go to dish and I always choose the johhny cake. If you're lucky enough to get a johnny cake when it's hot and fresh, man. Those things are sooooo good. This place is usually jumping so there will most likely be a line, but it moves fairly quickly. The dishes are in a buffet so you choose what you want and pay at the end of the line. Portions are generous and I usually end up eating half and saving the rest for lunch or dinner the next day. The price is comparable to other establishments. A lot of people visit this place because of Food Network and I have no idea what they seem to be expecting because they always seem to be so disappointed. I guess they expect all Jamaican food to taste the same?\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Cara P.",
    "yelp_id": "dn8c0gSvYdVpnhQrDr17Cg",
    "user_location": "Mt Juliet, TN",
    "rating": 2,
    "review_date": "1/8/2012",
    "comments": "I'm sorry...no.  I had the curried goat, collard greens, and sweet potatoes.  The greens and sweet potatoes were great, but the goat....  It was very tender, I'll give it that.  But the curry was waayyy too salty, and I'm sorry, if you're going to serve meat in a sauce like that (almost like a stew), TAKE IT OFF THE BONE.  And lots of gristle in the meat (for me, anyway; I have a thing about meat fat & gristle & tendon, euw).  My husband's jerk chicken was also much too salty (that was really the main flavor in both meats).  And the herbal peach \"tea\" tasted more like a soda: cloyingly sweet.  I'm really sorry, I wanted to love Jamaicaway.\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 2,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Morgan L.",
    "yelp_id": "RdJEaKX_BSH0Fp0FWCvZSQ",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "7/11/2014",
    "comments": "This place was suggested to me by a colleague who knew my Jamaican background. I came with really high hopes and I wasn't disappointed I settled on the Curry Goat since they were out of Ackee and Saltfish. It was really good! A little too salty but all the other flavors were on point. I agree with others that it is overpriced but I am willing to make the sacrifice. :)\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Kay L.",
    "yelp_id": "ifNooCa9otxj_EhGFRbv9Q",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "6/15/2012",
    "comments": "I almost never get downtown, but Jamaicaway remains my favorite restaurant in Nashville. When my dad suggested we meet here for lunch, he described it as \"Calypso Cafe on steroids.\" While I'm not sure how accurate a comparison that is, it's pretty impressive food.The best part for me is the prevalence of the vegetarian options. The vegetarian barbecue is the stuff dreams are made of, and if you have it with the sweet potatoes you might just go into a sugar coma. They have lots of appealing meat options too, and sell incredible local desserts as well.This is a must-go if you're interested in something a little different.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jamie D.",
    "yelp_id": "alF_72E35Q4bIsw5MXyZBQ",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "2/26/2010",
    "comments": "That is a 5 for best Jamaican food in Nashville. For lunch (the best time to go), I had the following: fried Chixen (fake chicken but tastes sooooo gooood) with a mango sauce, rice with black beans and sweet potatoes with pineapple. I washed it down with a can of coconut juice. Also, you get your choice between Jimmy Bread - fried heaven or corn bread.They have ammmazing style BBQ. The options here are endless. This is equally as good for vegetarians as meat eaters. They are fast to get you on your way and more than nice can get. I paid $10 for all that! Don't forget to get the pineapple hot sauce before you leave.\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Erin J.",
    "yelp_id": "Yl4W33ShuKg0IBOZqZfQcw",
    "user_location": "Brentwood, TN",
    "rating": 3,
    "review_date": "5/21/2010",
    "comments": "Really like this place & the fact that they have many vegetarian options that taste great!  Really like the vindaloo.  Nice addition to the Farmer's Market!I hold back  two stars due to the service - the last 2 times I've gone there I have waited for nearly 10 minutes without acknowledgement.  Very frustrating!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Tara J.",
    "yelp_id": "AKasXZ1lCqVwho86zfIwAg",
    "user_location": "Minneapolis, MN",
    "rating": 5,
    "review_date": "8/17/2011",
    "comments": "Three words: VEGAN FRIED CHICKEN!  Wow, their food is tasty.  I had the aforementioned fried \"chicken\", peas and rice (SO GOOD!) and fried plantains.  The service was so incredibly friendly - they apologized that we had to wait approximately 30 seconds to be served.  The prices are low and there's a fun flea market next door to browse after eating.  LOVE!\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 0,
    "votes_cool": 3
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jermaine W.",
    "yelp_id": "ukkjTbaO3qf0jjzyKSbgjQ",
    "user_location": "Atlanta, GA",
    "rating": 2,
    "review_date": "11/27/2012",
    "comments": "It's been a while since I have been here, I decided to take a break because my last experience was not so great. Jamaica NoWay! I'm done with this place, they have lost their touch, something is off, not sure what but something is off with the food. Either that or I have been exposed to real Jamaican food in other cities and this doesn't measure up..\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Felicia H.",
    "yelp_id": "2wF9fDcJgSGnvAvAshELjw",
    "user_location": "Dallas, TX",
    "rating": 4,
    "review_date": "11/6/2011",
    "comments": "Awesome food. Excellent customer service! Been waiting to try this restaurant for several monts. Glad i decided on Jamacia Way over Cheesecake Factory today. Excellent choice. Reminds me of Elaines Kitchen in Dallas, Texas. One more Nashville restaurant i can put on my list as a thumbs up! Hallelujah!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Kristina S.",
    "yelp_id": "VwbFpdN8fhMgxL4JDS8MXA",
    "user_location": "Saint Louis, MO",
    "rating": 4,
    "review_date": "10/3/2012",
    "comments": "Husband & I stopped here on our way back from South Carolina. I had the jerk chicken, pineapple sweet potatoes & collard greens & a johnny cake~all were delicious. My husband had the mango chicken that was amazing also. Will be back again next time we are down that way!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Deadria C.",
    "yelp_id": "i8PwLP_DhYaRW6_ruYUmSQ",
    "user_location": "Nashville, TN",
    "rating": 2,
    "review_date": "4/6/2014",
    "comments": "As someone who grew up on Jamaican food, and frequently visits different restaurants in different states, I must say I was quite disappointed. Not only is the food over priced but the patties are frozen and thawed out prior to serving. Each of the desserts are improperly labeled, there were various silverwares missing. Even in Jamaica you don't pay $10 for a small oxtail.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Good G.",
    "yelp_id": "m_Z0ZK4PVRBHgwt8cDXeOg",
    "user_location": "Mahomet, IL",
    "rating": 4,
    "review_date": "3/28/2014",
    "comments": "Authentic and good! Had the spicy jerk chicken an it didn't disappoint. The heat was perfect, not weak or overwhelming. Johnny cake was an A+, sides were average or better. Missed the mark for another star because I would have liked just a bit more of the main entree on the plate. Having said that, it wasn't too small. But I was hungry and it was good. Left me wanting more!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Ashley L.",
    "yelp_id": "2y9S4WMuSycl_HU53cqNNw",
    "user_location": "Philadelphia, PA",
    "rating": 4,
    "review_date": "7/29/2011",
    "comments": "Jamaican Jerk chicken is one of my favorites and Jamaicaway didn't disappoint!  The spicy jerk chicken falls off the bone and the sauce has the perfect amount of heat.  The steamed cabbage had amazing flavor and jonny cake was perfect for getting ever bit of sauce off the plate.  If you haven't tried Jamaicaway get there asap!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Zeb M.",
    "yelp_id": "FVzA-5cUVRYttsv5aFOqQA",
    "user_location": "Denver, CO",
    "rating": 4,
    "review_date": "9/14/2011",
    "comments": "So glad I finally got to try Jamaicaway! After hearing my girlfriend rave about their food and the two of us being at the Farmers' Market anyway, we stopped in for lunch and it blew me away. I had the spicy jerk chicken, green beans, and fried plantains (with a jonnycake on the side, which was sweet enough to be dessert). The chicken was the right enough of kick without it being too much and everything else was great. I would love to come back and try all of the sides alone! Also, my meal was only around $7 and the portions are hefty. You certainly get your money's worth!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Kelly M.",
    "yelp_id": "KMTdSbtNJb3EptvCVZ7Jew",
    "user_location": "Schaumburg, IL",
    "rating": 5,
    "review_date": "8/6/2012",
    "comments": "So freaking good. If I were to visit Nashville again I would go again, hands down. I actually visited because I saw it on the Food Network. I was NOT disappointed. I got a large plate of the mango chutney chicken, which was wonderful, with fried plantains, a johnny cake, and pineapple sweet potatoes. Yuum. All awesome. I also got the carrot-mango juice which was bomb ($3.50 but so worth it). Also the coconut-ginger brittle thing they sell on the side is AWESOME. The large plate is a huge amount of food, though, so it was difficult to finish. It became an awesome breakfast the next day! One negative is that it is on the expensive side, but is in my opinion well worth it (will spend anywhere from $9 to $20 per person). Also, the menu said $12.50 for the curry goat and they charged my friend $13.50, which she caught on the receipt and pointed it out. The manager said they were \"in the middle of changing the menu\" and gave her the difference.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Peter K.",
    "yelp_id": "iqERg1gRi-yFnq76GPdH1Q",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "2/26/2010",
    "comments": "Agreed with Jamie...Be sure to try a spicy Jamaican beef patty, some of their peach tea, and the Johnny cakes with jerk chicken.This place is seriously slept on....definitely a gem in the Farmers Market.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Eliza R.",
    "yelp_id": "yfn0_Hwre2fFgXimJzWbSg",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "8/5/2011",
    "comments": "I am a huge fan of Caribbean-inspired cuisine thanks to another local restaurant called Calypso Cafe. However, Jamaicaway was recommended to me for truly authentic Jamaican cuisine. My friend and I popped over after visiting the farmer's market next door and they had quite a variety. I ended up getting the mild jerk chicken, with pineappled sweet potatoes and green beans. The portions were huge and it was only about $7. The chicken was super tender and practically fell apart when I stuck my fork in it... not to mention how savory and spicy the sauce was! The sweet potatoes were some of the best I ever had - nicely sweetened with some cinnamon and brown sugar, and just the right amount of pineapple to give a bit of a fruity kick. I can't wait to go back again and try some new dishes.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Billy P.",
    "yelp_id": "HpqfDLVaXkEnN4y4TVMBGw",
    "user_location": "Lyndhurst, NJ",
    "rating": 4,
    "review_date": "12/8/2010",
    "comments": "I've been to Jamaicaway 3 or 4 times now for lunch.  Everybody I have taken liked it.  The food here is really good.  I usually get some of the fake meat vegetarian options they have.  I had the Johnny Cake the first time and did not get it again - too dry and doughy for me, but some like it that way.  I always get corn bread instead.  Lots of options and right around $10 for a main dish, 2 sides and a drink.  I hear this place has been struggling since the flood and might go out of business.  That would be a shame.  Go to Jamaicaway!  You won't be sorry.  P.S. Get plantains!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 2
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "D.T. B.",
    "yelp_id": "__HVKcFKVdr6lVFH2rdQVw",
    "user_location": "New Haven, CT",
    "rating": 5,
    "review_date": "1/10/2011",
    "comments": "Five stars for being the best Jamaican food in Nashville.  LOVE the goat and oxtail.  Not the best service, but the fresh and authentic food makes up for that.\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Chris S.",
    "yelp_id": "HrSvgti1rUVUrq2qihFRng",
    "user_location": "Aliso Viejo, CA",
    "rating": 4,
    "review_date": "1/7/2012",
    "comments": "stumbled in here because the Indian place was closed. Man, this place is good and completely authentic. I am hooked on the scotch bonnet sauce. I didn't think the jerk chicken was very jerky, but the goat was amazing. Greens were excellent, and the staff was friendly. I would make a return trip the next time we are out there. Saw Guy Fieri painted his mug on the wall, so I guess he thinks that it is money.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Steph H.",
    "yelp_id": "NyKFSZALO2r987KWjjkLzA",
    "user_location": "Toronto, Canada",
    "rating": 3,
    "review_date": "4/25/2011",
    "comments": "I really really want to like Jamaicaway, since my mother is from Trinidad so I grew up on many Caribbean staples that are pretty difficult to find anywhere else in Nashville. This is the only place where I can routinely get a goat curry wrapped in a roti or some oxtail, so for that reason alone, I'd probably give it a pass.But the problem with places that feature food that reminds me of my childhood is that I'm going to have a pretty high bar set and I can't honestly say that Jamaicaway is hitting that bar. While I appreciate how tender they get their goat, I sometimes feel like the spicing is off in the curry base, and if you're going to get the goat roti (which is essentially like a big burrito filled with goat curry), it would be nice to only have boneless meat in there, otherwise you are in for a nasty surprise. My other qualm is with the callalloo, which they make using turnip and other various greens, which is just not the way it's meant to be done. Callalloo is a plant that is very similar to spinach and while you can make it with other greens, it won't officially be callalloo in my book if you do so. Additionally, I hate that they use all the parts of the greens they do use, meaning that you get bunches of undigestible and unplatable fibrous bits that are a bit like chewing bamboo. Not pleasant at all.Also, I don't want to fault Jamaicaway on being successful, but I think it is fair to say that if you come during the lunch hour, this place will be busy and service will suffer for it. Even though it's cafeteria style, the line always seems to stall, especially as I always seem to wind up behind someone who is ordering 5 or 6 meals to go. I do find the hours pretty inconvenient as well, as this is yet another one of those Nashville restaurants that only seems to be open for lunch or an extremely early dinner. I also think that the food is a little bit pricey, personally. Maybe if their goat roti were the best I'd ever had I could see spending $11 on it, but I've had better for a fraction of that price. The portions are generous, but I generally find that I don't want to eat my entire meal because the flavor just doesn't have the proper refinement.I appreciate that Jamaicaway is filling a niche here in Nashville, and for that I give it some extra points, but whenever I go, I can't help but wish it were better. I guess that like authentic Chinese food, I'll just have to wait for the Caribbean flavors I know to make it to Nashville.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jonathan S.",
    "yelp_id": "lvGlIBv4xkHiQBnNOuRYZQ",
    "user_location": "Orange County, CA",
    "rating": 4,
    "review_date": "7/31/2009",
    "comments": "you can imagine my surprise when i was passing through nashville and at a random bar when a guy told me the next day i needed to eat lunch at this jamaican place at the market. jamaican in nashville? its a small little place laid out cafeteria style. jerk chicken and sides were real good and from what i hear we made the correct choice for that one day we were there for lunch.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Paul H.",
    "yelp_id": "omJUEayO0J0UfNEpW3QnTw",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "8/7/2008",
    "comments": "I am totally a fan of Jamaicaway Restaurant.  It's hidden in the Farmer's Market building behind the Capitol.  But, it's worth the trek.  At lunch time this place gets packed, so keep your eyes peeled for a table.  But, don't loose focus.  When it's your turn at the front of the line you must not hesitate.  Hesitation will kill your momentum - like it did mine on my first trip.  It's almost like a classic meat & three place where everything is pre-prepared and you peruse and select.  I started out with the traditional jerk chicken.  I chose the mild, but would have probably preferred the spicy better.  I've also had the curried goat - which was both frightening and exciting.  Both meals turned out really well and I would totally recommend this place for a lunch-time visit.  The sides are pretty varied too.  I've tried everything from fried plantains to sweet potatoes and steamed greens.  I will say that I was a little disappointed with their johnny cakes though, not much flavor.All in all, Jamaicaway is a really good lunch-time value.  It's busy, but not too crowded, and parking is super easy.  Go, try something new.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "X O.",
    "yelp_id": "xMC8vwA5BegnDuK3rjtlAQ",
    "user_location": "Los Angeles, CA",
    "rating": 5,
    "review_date": "10/30/2012",
    "comments": "I've been here twice. The staff is friendly and helpful. They gave me samples with a toothpick. They had several main dishes for vegetarians, the BBQ tofu was tasty. The sides were simple but delicious, I tried the collard greens and cabbage. The fried bread is great to wipe up all the tasty sauce. They serve good sized portions at a reasonable price. The line gets long quickly at lunchtime.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Rachel S.",
    "yelp_id": "5dYduxPNouuR5SI3V1OtCw",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "5/10/2009",
    "comments": "Good fresh \"fast\" food.  Jamaicaway is laid out \"foot court style\", in that the hot dishes are presented behind glass and are scooped onto your plate right in front of you as you order it.  With the exception of what I ordered today, which was the Spicy Curry Gluten (as in wheat gluten, as in seitan).  It wasn't quite ready, so the man behind the counter told me he'd deliver my food to my table.  He did.  With the curry I had friend plantains and stewed almost Indian-like cabbage.  And a johnnycake, which I will explain later.Jamaicaway has an enticing selection of meat dishes (oxtail, goat, and chicken) with an additionally enticing variety of vegetarian dishes. (Tofu, gluten, etc.).  The price of an entree with two sides was a little under $9.  Pretty good.  Sides include but are not limited to plantains, cabbage, collard greens, sweet potato and pineapple, and different rice preparations.The johnnycake... I suppose I expected an American johnnycake, a pancake flap jack thing.  Was I wrong.. each meal was served with a johnnycake, a palm size piece of deep-fried, dense dough.  Woah.  I'm glad I tried it, but another may kill me.  Small, not a fantastic choice for a huge group of people.  Try Jamaicaway.  Especially if you are vegetarian, as you will appreciate the dishes that honestly do cater to you.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Nichole R.",
    "yelp_id": "sBFZvuYjsYUW4al8277iNQ",
    "user_location": "Ashland City, TN",
    "rating": 4,
    "review_date": "8/2/2011",
    "comments": "I went for the first time today and I will be back and take friends with me!I had the brown stew chicken with the pineappled sweet potatoes and rice and peas.  It was all great. If you have a cinnamon allergy you shouldn't have these choices.  The cinnamon isn't overpowering at all but it is there.   The herbal fruit tea was very sweet but they were very nice and brewed us up some unsweet.  The atmosphere was great for lunch.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Emily B.",
    "yelp_id": "30jr2jIMah8zu0Jqjpfcag",
    "user_location": "Chicago, IL",
    "rating": 4,
    "review_date": "2/19/2013",
    "comments": "I'm nowhere near a Jamaican food expert, but what a tasty lunch this was! I tried the jerk chicken (fall off the bone tender!), plantains (perfect crunch), collared greens (perfectly cooked and seasoned), and johnny cake (mmmmm). Wish I could go back and try more on the menu!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Kayla P.",
    "yelp_id": "jbE-BfdukAShKmSwrX_Rfw",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "1/13/2011",
    "comments": "I stumbled upon Jamicaway last week while I was looking for glass-bottled Ting for my boyfriend. We had just come back from a great vacation in Negril, Jamaica from Christmas/New Years. When I walked into Jamaicaway, I was incredibly excited to see not only the Ting that he had drank every night while we were there, but the Beef and Chicken patties we snacked on late at night.  I looked over the assortment of food being served, and one of the women behind the counter was very friendly about explaining how one went about ordering, but I knew all I wanted was a Beef pattie(spicy was the only was to go in Jamaica!). I walked to my car and took a bite and closed my eyes and I was back on the beach!!!! This place is awfully authentic, while there was quite a crowd, the staff knew just how to handle them and got them in and out quickly.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Jason N.",
    "yelp_id": "QgYyau5z3Aw3aZg80qeA8w",
    "user_location": "Hermitage, TN",
    "rating": 5,
    "review_date": "10/21/2008",
    "comments": "JamaicaWay has damned near everything you could ever want in a restaurant:-Well prepared, fresh food-Knowledgeable, friendly staff-DeliciousnessI have had the Curried Goat, Braised Ox Tail and Vegetarian Chicken.  It is all fantastic.  If I were told that I could only eat at one restaurant in this town again, this is the one that I would pick.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Valerie D.",
    "yelp_id": "HB0ey7292ttRzG3OGjlckQ",
    "user_location": "Rockville, MD",
    "rating": 4,
    "review_date": "3/22/2011",
    "comments": "Great food and great staff - very island style!  Definitely try the curried goat!! Johny cakes are amazing. The rice and peas are a little different than the recipe I know but still good. Fried sweet plantains are a must, of course!  Even the coco bread and fresh coconut water were fantastic! Congrats on the Diners Drive Ins and Dives fame - you deserve it!  Next time we are in Nashville, I will definitely try the vegetarian options. They looked delicious too!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Senaka G.",
    "yelp_id": "QQfZyLI5PYoNDin3sD5bLg",
    "user_location": "Columbus, OH",
    "rating": 4,
    "review_date": "10/17/2011",
    "comments": "Got the goat curry yellow rice , beans beef patty. Goat curry was very flavourful not spicy more like a yellow based curry. its,more like boiled in its own juices so expect it to be very goatish. Beans had a funny limy taste but passable. Yellow rice was nothing bad. Beef patty was deffy worth it good chunk of meat in it. Tried some calypso sauce and it was good(good way to make things spicy) i did see the other dishes and eggplant curry looked awesome. Staff is very friendly mayb they should gv more rixe but im satisfied with it. Cost me 12.50 for all.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Ian R.",
    "yelp_id": "26YpEJpa4uwJ60ezG9MIfQ",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "4/16/2009",
    "comments": "Jamaicaway is the best choice for affordable Caribbean comfort food in Nashville.  The selection is not huge, but everything that the do, they do well.  It is very hard to beat the Jerk Chicken meal at lunch time.  It is delicious, affordable, and a ton of good food.  Did I mention the johnny cakes, the ginger beer, the homemade hot sauce... Do yourself a favor and check it out.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "ALEXIS P.",
    "yelp_id": "l0HSA702cUWrXAg7LaLziQ",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "12/29/2008",
    "comments": "One of my favorite, most decadent lunch spots.  I am impervious to the fried plantains, yams, cakes, and homemade juices.  The proteins are always delicious as well, you cannot go wrong with any of the choices, even the most unusual-sounding meats and preps.  It's a good place to get adventurous- maybe even try the peanut butter juice!  im serious...  I would love it if they had more daily specials (even though their offerings are always wide and diverse) and homemade ginger beer, please!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "jamaicaway-restaurant-and-catering-nashville-2",
    "user_name": "Louisa R.",
    "yelp_id": "NbHhtgRT1cEF0W9X4mcXzA",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "9/26/2009",
    "comments": "awesome vegan/ vegetarian options! the gluten fried chicken is awesome, although not vegan (i think it has whey) and all kinds of other veggie options daily. the barbecue portabellas are also delicious! definitely worth checking out if you are vegetarian, vegan, or not!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Merlin C.",
    "yelp_id": "bV-bRxZQzNopoRzSah3s1Q",
    "user_location": "Manhattan, NY",
    "rating": 5,
    "review_date": "5/7/2017",
    "comments": "\"Mwah!\" as my friend Lauren R. would put it. (She usually says this when describing gory horror movie scenes that gross everybody else out, but whatever, context be damned.)I went to Cook Out because I had a sweet tooth, was YOLOing with personal health and wellness during this Nashville weekend (at a certain point, you just go 'all in'), and became intrigued with the 40 flavors of milkshake that they had on offer.  This milkshake puts to ABSOLUTE SHAME many overhyped outlets like Shake Shack, In N Out Burger (west coast), and even reputable diners that have received 5 stars for their milkshakes. If I got metaphorical with how good it was, this Yelp page would get an \"X\" rating -- that's how good it was. (Relax, I'm a G-rated guy, and I won't vulgarize my page.) An unbelievable milkshake.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Christina A.",
    "yelp_id": "ZVEQwcU4Aby_rSSC2sY5Yg",
    "user_location": "Wheaton, IL",
    "rating": 5,
    "review_date": "4/22/2017",
    "comments": "Best drunk food in Nashville. So cheap. So good. Chocolate cherry milkshake and hush puppies is my literal jam. Sober, not the best, but still ok. Again, so cheap. But so good. The hush puppies. Best in the world. I literally emailed Cook Out corporate asking if they could cater my 21st birthday. While they didn't respond, I think this demonstrates my commitment to this fine establishment.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Chrystal G.",
    "yelp_id": "KZMou24-EPqmuR6VfGFHyw",
    "user_location": "Chesapeake, VA",
    "rating": 5,
    "review_date": "3/30/2017",
    "comments": "This place was a life saver after the fiasco we had at a fast food chain a block or so up. So glad we found it when we did. It was late, we were starving, and had just been treated awful at another place. The line here was long, but we decided to wait it out instead of search for somewhere else. They got us in and our pretty quickly. All of our food was correct and so good. And the staff was a breath of fresh air after dealing with the staff down the road. They were friendly and courteous, despite how busy they were, and made sure we were good to go before sending us off.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Tammy T.",
    "yelp_id": "5cnL1iIxz7rLhl0IwgIhAQ",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "2/9/2016",
    "comments": "This place deserves 5 stars for being the real MVP when I need to satisfy my midnight drunchies or muchines. Let's be real, we've all had those times when we're craving something fried and bad, but nothing is opened. Not only is this place opened late, it has all kinds of wonderful fried concoctions and tons of drink options that you can choose from. Best of all are the prices. You can get a whole box of food for only $5, it honestly doesn't get better than that. Cookout is honestly the place where I can let my inner fat girl come out, no shame at all.\n        Was this review …?\n    ",
    "votes_useful": 10,
    "votes_funny": 10,
    "votes_cool": 10
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Brandon B.",
    "yelp_id": "8eU4mKR8X9BNkEBGR5Ti0A",
    "user_location": "Raleigh, NC",
    "rating": 5,
    "review_date": "4/10/2017",
    "comments": "We moved from North Carolina and miss having Cook Outs always close by. There are a couple in the area and this one is great. Unlike most NC locations this one and the one in Murfreesboro have tables and aren't just the drive-thru. Quality here has been on par with any Cook Out we've ever been to. Fresh, hot, well-cooked, and very tasty. This taste of home is just right. Oh and yes they have Cheerwine.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Queen B.",
    "yelp_id": "LMvGr9_gUrIwnD2iBS5MlQ",
    "user_location": "Nashville, TN",
    "rating": 3,
    "review_date": "8/28/2016",
    "comments": "Very, very, very surprised that this particular Cook Out got our orders right!The one on Gallatin, in East Nashville NEVER gets our orders right..But today, we drove through to get the kids something and before we left the window, we checked our bag to make sure everything was in there ---- AND IT WAS!!!Hurray!It sucks when you order food, get home, only to find your order is incomplete..  like the Cook Out on Gallatin, in East Nashville. They have NEVER gotten my order right..but this one, did!I am jumping for joy!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Ian C.",
    "yelp_id": "S6EDLktpxgvfygBnewHGAA",
    "user_location": "Vancouver, Canada",
    "rating": 4,
    "review_date": "12/27/2016",
    "comments": "Ordered some milkshakes and onion rings as an in between meal snack and they didn't disappoint. Had the chocolate chip and mint - thick savoury and amazing. The onion rings were nice and freshly fried so can't really go wrong. Though we didn't have the food, the smell was pretty amazing. Would definitely come back.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Molly F.",
    "yelp_id": "ofHKd8FRpu8jPwK2oR5ygg",
    "user_location": "Brooklyn, NY",
    "rating": 4,
    "review_date": "6/7/2016",
    "comments": "Four stars is probably a lot for any fast food place, but whatever. Visiting Nashville from NYC for work, cookout is across from my hotel, went in at 11pm in a Tuesday. Cookout was busy but the staff was friendly. They kindly corrected an order for someone who came up with a mistake. My food took maybe 5 minutes. I ordered the combo deal. My Cajun fries didn't appear to be Cajun at all but they were still good enough. Hard to find ketchup at the place I think you have to ask for it. Spicy chicken sandwich wasn't spicy at all. It was basically a McChicken. I got a corn dog as one of my sides and it was delicious. It and the shake were the best part. The shake is more of a cup of ice cream, definitely requiring a spoon over a straw. I ordered a Reeses Cup shake, which is a vanilla shake with reeses in it, not to be confused with the peanut butter fudge shake.The restaurant was clean and the decor was cute, made it more comfortable to eat there than in a McDonald's or wendys.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Jesse Q.",
    "yelp_id": "KXDiP5LvmOIAH2M7rQyquw",
    "user_location": "Antioch, TN",
    "rating": 5,
    "review_date": "12/1/2016",
    "comments": "If your looking for great food at a economy price this is the place this is a basic restaurant but the food is prepared properly and it's a great place for the beginning for dating they offer 10 different food options starting @ $4.99 and alot of college students also come here\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Beth G.",
    "yelp_id": "ceFHavITrot4UAW5DG54tA",
    "user_location": "Nashville, TN",
    "rating": 3,
    "review_date": "4/7/2016",
    "comments": "Lunch round up for the office. We were on a mission to 3 total places and stopped here first. Lunch drive thru busy. Inside busy. One reviewer stated the lunch does not do the volume the late night cravers do when in needed of munchies. THEN THAT should mean this place is CRAZY at night. It was consistently busy. Menu is extensive in a fast food way, BUT there is a catch. GET the 4.99 TRAY. Easy Peasy. Get the main meal, hamburger, or double hamburger 2 hot dogs, quesadilla chicken or beefy, BBQ, chicken sandwich, spicy reg or cajun, bbq and strips. Then get 2 sides, which are quite large. Could be fries or Coleslaw, quesadilla, hush puppies, onion rings, chicken wrap, corn dog, bacon wrap. AND then a LARGE Drink. Sweet tea or Unsweet Tea or Soda, bottle water, cheer wine or add 1 dollar for shake. All in a box to go. NOW really?!?!? You have to at least try this concept. So changed my ideas for lunch and ordered the double burger. It was really really flat. I guess I expected a little thicker like In and OUT. Nope smash down flat like wimpy small burger. Burgers are made to order, so had lettuce and tomato, both fresh and extra mustard. They totally got that right. Sides were fries with the cajun seasoning oher yelpers reviewed and 1/2 the box.  Totally made the  meal. 2nd side was the Quesadilla, chicken. Literally tasted like the Taco Bell Quesadilla across the street. I really thought it was. Both are 1 dollar if bought separate. So take away, FRIES and Unsweet Tea ruled the lunch. Actually not a bad lunch at all. YET,If you are looking for damn good burger, keep it moving, but Fries yes, Large Drink go for it. Service was really great and kept the drive thru moving.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "John S.",
    "yelp_id": "E9F8V_jgFZCZScvQ_Odt3w",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "11/2/2016",
    "comments": "It's rare that a fast food joint can pull off fast, good and cheap. But now I understand the hype that surrounds Cook Out. I got a \"Cook Out tray\" consisting of a plain cheeseburger, sides of chili and onion rings as well as a large drink -- all for under $6. With the \"backyard barbecue\" theme, I was worried my burger would have that unfortunate dried-out texture, but thankfully that was not the case. The burger was juicy and complemented well by the melting cheese. The chili was thin with a mild kick. It reminded me of a cinnamon-less version of Skyline Chili. The onion rings were fresh and much better than ones I've had from other fast food establishments. The menu is a bit overwhelming, but that's all the reason to make a return trip.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Lucas N.",
    "yelp_id": "jEgZSOFkrsZv_7bfz7nf7g",
    "user_location": "Franklin, TN",
    "rating": 3,
    "review_date": "11/5/2016",
    "comments": "First of all I want to start with...this is not a 3 star restaurant. However, I do give this restaurant  3 stars in the event that you experience it in a time that I did. Coming home from a Midtown bar, looking for something cheap that you crave. The trays are your friend and the combo I chose was Cajun Chicken, Chili and a Quesadilla. Feels like heaven at 11 pm.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Matt D.",
    "yelp_id": "gIzS3s4yZm6WiXM3TcQMPQ",
    "user_location": "Ashland City, TN",
    "rating": 4,
    "review_date": "3/11/2016",
    "comments": "I have eaten at a Cook Out in North Carolina before and really enjoyed it there. So, I was pleased to find them in Nashville. They are usually very quick at getting your food made and the folks that work here are very nice. They have a very good variety of menu items so there is just about something for everyone even the picky folks. I generally get the combo which has many choices. I ten to get the burger with a corn dog and fries.   This convo with a drink is less than $6 including tax so great value there. Most all of their menu items are fairly priced if not cheep. One thing they do very well is their milkshakes. They have a huge milkshake menu. I really like the banana one but have been branching out and trying different flavors. This location is very clean so they should be proud of that. If you have never tried it you really should consider it!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Sylvia C.",
    "yelp_id": "jSioQ8IlvKmkPID0K7PhDw",
    "user_location": "Phoenix, AZ",
    "rating": 1,
    "review_date": "1/13/2017",
    "comments": "This is terrible.  The guy that took our seemed stoned. I ordered bacon cheese hot dog and onion rings. Bacon was burnt no onions rings.  Told the guy I ordered onion rings he just looked at me helped next person in line . Will never go back Jack in the box better than this place.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Maria K.",
    "yelp_id": "bTTTpFaHmyRB-ZUTbWa48g",
    "user_location": "Nashville, TN",
    "rating": 3,
    "review_date": "12/26/2015",
    "comments": "Alright peeps I'll keep it pretty simple; At the end of a crazy night, cook out deserves 5 stars. But if you are 100% sober then the food is one star. Thus, I am giving the odd establishment a 3. That seems fair right? Let me share a story with you. The first time I went to cook out, it was at 3 AM after a night out on demonbreum. I thought I had died and gone to heaven. For five dollars I had a a burger and a HUGE thing of fries (always ask for the cajun seasoning!) and a large drink! It was AMAZING. So amazing that I went back the next night for dinner. Much to my disappointment the food was greasy and disgusting. Now obviously, Cook out does not make their money from their \"lunch crowd\". I swear that it's ten times busier at night than it is during the day. That being said, if you do go then check out their five dollar meals because they are ultimately a great deal. Also they have milkshakes that are always good, no matter what state you are in!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Jesse E.",
    "yelp_id": "RgmWmKKwj8Xv6N8UteS5oA",
    "user_location": "Millbrae, CA",
    "rating": 2,
    "review_date": "1/21/2017",
    "comments": "Luckily I love most of CookOuts food. But I went through the drive through & got my entire meal wrong. I ordered a Hamburger tray with hush puppies & a bacon wrap & a Huge tea. The only thing I got that was correct was the hush puppies & tea. & on the receipt on top of my tray my order was correct. So I guess they just put random food in my tray.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Jeff P.",
    "yelp_id": "NQDNh3dl_O5oeL3umC2dDA",
    "user_location": "Kingston, TN",
    "rating": 4,
    "review_date": "9/23/2016",
    "comments": "My wife and I ate here 3 different times over the course of our week-long stay in Nashville's West End. This location doesn't disappoint. We had hamburgers, chicken sandwiches, french fries, and onion rings. The food was always hot and delicious.This location can get crowded as far as parking sometimes. We drove thru each time and the line moved very quickly each time.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Jelly R.",
    "yelp_id": "cMUcY6xVqnnZEEyj5YqDow",
    "user_location": "Indianapolis, IN",
    "rating": 4,
    "review_date": "1/8/2017",
    "comments": "This is just a fast food type restaurant, but I am not from Nashville and feel compelled to review it because the concept is neat: The burgers seem to be hand-packed and taste like they were made on a grill, like the kind of burgers you would have at a small cookout with family or friends. You get to choose two sides, and a drink is included as part of the \"meal.\" I chose the bacon wrap (which was a small tortilla with bacon and lettuce and sauce inside) and onion rings as my sides. The sides are small, but perfect to quell a craving without having to commit to a large, separate order of something. The burger was wrapped up in aluminum foil, as was the bacon wrap, and it was all put in a Styrofoam container. It made me feel the way you feel when someone makes you a plate to take home from a family cookout (as weird as that may sound). And I couldn't believe the prices: A little over $12 for two people to eat!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Jane M.",
    "yelp_id": "RiOvKcUrQ1_ymc6bXWc90g",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "11/30/2016",
    "comments": "My coworkers and I love going here for lunch. We work downtown, so there's not much to choose from within walking distance, but this is a quick short drive. The food has always tasted fresh and it is always quickly ready. I love their Cajun Chicken Sandwich. I also love that they have Cheerwine which not many places around here have. They also have good crushed ice. There is nowhere else in this town that you can get an entrée, 2 sides, and a drink for $5.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Trista D.",
    "yelp_id": "_I81s_MOtrkt3Up76dSWcg",
    "user_location": "Durham, NC",
    "rating": 4,
    "review_date": "11/7/2014",
    "comments": "So here's the deal, my fiancé and I would go to Cook Out every time we visited his family in NC. It was my treat. So, imagine my excitement when I saw one while driving down West End!This place was once an Arby's and I complained about the location and parking then. That hasn't changed but that is my ONLY complaint. I've been 3 times now (I really need to stop ) and each time the service was great as well as the food. Everything is always fresh and the shakes and sweet tea are must trys. Try a cheddar burger or chicken tray, get your fries cajun, add one packet of lemon juice to your sweet tea unless you opt for a shake (you can mix shake flavors btw) and these are NC style hushpuppies (love) so if you try them, don't expect the round fluffy ones. Great fast food at an awesome price. Welcome to Middle TN Cook Out!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Johnny C.",
    "yelp_id": "5WoEc6cQwyA9kufJNi6Yow",
    "user_location": "Bedford, TX",
    "rating": 3,
    "review_date": "9/9/2016",
    "comments": "Not a bad back up fast food place if the wait at Hattie B's is over 1 hour long. Honestly, when me and my group got to cookout, we were not expecting much, but the good thing was that the inside was relatively clean and the atmosphere was calm and casual. The ordering process was smooth and easy because there was almost nobody there. In regards to the food, I got the $4.99 value combo. This combo lets you choose a burger, 2 sides, and a drink (please opt to pay the $1 fee to get the fancy shake). I got the double burger and the two patties it came with were very thin and there were hardly any toppings added onto it. In addition, I got the onion rings and chili as my 2 sides. I was horribly disappointed at the portion size of the onion rings, I mean 3 onion rings? Seriously? If you want a side that comes with a bunch of food, definitely opt for the french fries. You will get a large handful of them (also the chili came with an extremely small portion and tasted like canned Hormel chili). The only thing that legitimately saved this disastrous value combo was the fancy shake, which is basically a heavenly milkshake. I got the cherry pie fancy shake and it was delicious (I should've ordered two). The milkshake was thick and creamy (decent portion size), it even had cherries inside of the shake. Honestly, it was probably one of the best milkshakes I have ever had and I highly recommend getting a fancy shake here, they have like 20 different flavors! Overall, if you are looking for a bargain fast food meal, I highly recommend Cookout because you will not be disappointed at the prices or with the fancy shake!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Kristie S.",
    "yelp_id": "KnqAuE29Lmgs_SwLhG31zg",
    "user_location": "Antioch, TN",
    "rating": 4,
    "review_date": "11/3/2016",
    "comments": "First time there.  Son recommended and they met my expectation from all his \"hype\".  Very good, hot, fast, very reasonable price.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Norene R.",
    "yelp_id": "v9lqifWML1G3Cbwwlwp9Ig",
    "user_location": "Nashville, TN",
    "rating": 1,
    "review_date": "10/30/2016",
    "comments": "I grew up in NC and pretty much grew up on Cookout! Sad to say that I'm highly disappointed in this Cookout. It is by far the worst Cookout I have ever been to! Their customer service has been shitty since they first opened and continues to get worse! Their employees have been rude countless times (especially when going through the drive through) they always seem to have an attitude! When you receive your food the order is NEVER correct! It's either wrong all together or it's missing something! I won't be returning to this Cookout and I can only hope that whoever owns this one trains their staff better and gets it together!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Mark H.",
    "yelp_id": "dnbYpLu_hJGTKHbj3AygKw",
    "user_location": "Dallas, TX",
    "rating": 1,
    "review_date": "4/9/2016",
    "comments": "Initially, I was excited for this place. I love anything charbroiled. Now, I can pretty much excuse most behaviors of the hourly/fast food workers, but there are times when even I am dumbfounded. So I ordered my food, which consisted of 2 huge burgers with cheese. The name is poorly thought, but I digress. I leave the drive through drive to my hotel then notice there was no cheese on my burgers. I drive back to the store, and go through the drive thru, tell the lady that my order was wrong and that I'd like new burgers because these were wrong and now cold. She tells me she'll give me the missing cheese?!?!?! What? You won't make me new burgers? Nope, pull to the window and get your missing cheese. I pull to the window and she gives me two cold pieces of cheese wrapped in foil paper... Seriously, foil paper! I've never been done this way, and I am very disappointed in this treatment. I won't recommend this place to any of my friends. I am posting pics of the cheese if you wanna see it!\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Bob B.",
    "yelp_id": "7_uOd3cUn3em27fKQbFjSA",
    "user_location": "Nashville, TN",
    "rating": 2,
    "review_date": "8/17/2016",
    "comments": "Got the double giant burger with ketchup, onions,pickles and cheese. Wasn't that giant and was really dry, don't really believe they wait to make it till you order it. Oh, got fries and Chili as my sides.. Fries were just there, big hunks of potato but that's just it. No flavoring not even salt. The Chili was ok, bit spicy but tolerable. Might reduce the heat on that just a bit. Also got a Cherry Cheesecake shake, was not good at all, took a few sips and gave it too my dog. I probably won't be back. It it cheap but as they say you get what you pay for.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Madi A.",
    "yelp_id": "ZV267bdYC2wfRThnIM1enQ",
    "user_location": "Nashville, TN",
    "rating": 1,
    "review_date": "1/10/2016",
    "comments": "Ordered a cheese dog (hot dog) my order had no hot dog in it. Also ordered chicken nuggets with buffalo sauce and got sweet and sour sauce. Not a hard order to get correct.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "JD And Lesley H.",
    "yelp_id": "KSOhitKX_6C3ftRdDGQgqQ",
    "user_location": "Dickson, TN",
    "rating": 1,
    "review_date": "1/18/2016",
    "comments": "This place was obviously better when it first opened! I stopped here for my first time to try it out this was by far the worst burger I have ever had! frozen beef patties stale bonds and white lettuce it was so nasty I took a couple of bites and threw it away!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Caitlin C.",
    "yelp_id": "crgWPc35LxjJccLFVQsQig",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "10/23/2014",
    "comments": "Cook Out is straight up fast food, to expect anything other than fast food quality is ridiculous. If you want to know why Cook Out has cult followers, it might be a good idea to read yourself this artcle, deadspin.com/5883076/i-h…Happy Cook Out eating! Get a Fancy Shake, you will not regret it I am now satisfied for another year or two... can't believe Cook Out came west to Nashville.\n        Was this review …?\n    ",
    "votes_useful": 4,
    "votes_funny": 3,
    "votes_cool": 4
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Melissa K.",
    "yelp_id": "i-vVKsA2HNqBCugnGB-_oA",
    "user_location": "Geneva, IL",
    "rating": 5,
    "review_date": "8/8/2015",
    "comments": "This place is amazing. Looking for a drunk munchie at 4am and this place came to the rescue. My hero. I got an entire smorgasbord for $6.... My life is now complete.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 2,
    "votes_cool": 2
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "David M.",
    "yelp_id": "LOlgBFUfaehokWl7GoGueA",
    "user_location": "Lilburn, GA",
    "rating": 1,
    "review_date": "1/23/2016",
    "comments": "Ordered two chicken sandwiches and a burger and asked if they were going to be fresh but upon receipt the chicken sandwiches were extremely cold borderline frozen in the middle. Very disappointing considering the location to all the hotels here.\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 1,
    "votes_cool": 2
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Tonya C.",
    "yelp_id": "cWawx_1E2FLZjvUR1n5WXw",
    "user_location": "Old Hickory, TN",
    "rating": 4,
    "review_date": "6/10/2016",
    "comments": "I think this is a better alternative to McDonalds, Burger King, Jack In The Box, etc.. when you are downtown. We've eaten here at lunch, mid afternoon and early evening when leaving the hospital for the past  6 weeks. The Cook Out Tray is awesome and you are full.  We've gotten the cheeseburger, chili ànd chicken quesadilla with unsweetened tea, hamburger with fries, onion rings and coke float, cheeseburger cheddar style, fries, quesadilla and a shake, chili dog, chicken sandwich,  and  other items from the menu. They have something for everyone for our large family and pretty reasonable in pricing.  We've always gone to the drive thru with speed and accuracy and the employees have always been nice and courteous.  Will be back again.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "David O.",
    "yelp_id": "zF10BKjK4Lz9U_8Yqw28ww",
    "user_location": "Nashville, TN",
    "rating": 3,
    "review_date": "11/28/2014",
    "comments": "A decent little lunch stop.  While I am sure it's trying to be the In-N-Out of the east, it has more to offer with its Shakes than it does its burgers.  I'm not saying I hated the burger, but it just didn't seem to be all that great.  I'm unsure if this was due to the rate they were moving people through the line or if I just didn't enjoy the burger as much the second time. I gave the Cook Out in Murfreesboro a higher rating and i'm a bit unsure where the bias is exactly.Of course I'm sure I haven't made my last visit to Cook Out, so we'll see if this location acquits itself a second time.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "CT L.",
    "yelp_id": "PY-Fhe42xYssM4v2x6wzmA",
    "user_location": "Henderson, NV",
    "rating": 1,
    "review_date": "6/15/2016",
    "comments": "Don't waste your money or time.  Visited this location on 06/14/2016.  I never even got to taste the food because I ended up spending my time arguing with kymbryana  in the drive thru.  They have the worst customer service skills!  The staff was rude, condescending, augmentative and just downright nasty.  I spoke with the manager and he had difficultly addressing  the issue because she wanted to argue with him as well.  Wow !  It turned out to be a side show circus.   Horrible experience and from the likes of some of the other reviews, it seems to be an ongoing issue.  Find somewhere else that actually wants customers.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Charles L.",
    "yelp_id": "dj_d9rBwpNbLrzgSw1fkLg",
    "user_location": "Franklin, TN",
    "rating": 2,
    "review_date": "10/22/2015",
    "comments": "Burger reminded me of Five Guys. Only difference is that FG's burgers are always HOT. Onion rings were good, but I can get better at Sonic.And what's with all the unhappy employees? I didn't see a single one wearing a smile. They weren't rude, but I got the distinct impression they wanted me to leave as soon as they took my $$.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "William R.",
    "yelp_id": "Hr9hNShWc-UaAMVMwGeUWQ",
    "user_location": "Nashville, TN",
    "rating": 3,
    "review_date": "10/13/2015",
    "comments": "this place is a hit or miss for meI had a cheeseburger from there a few weeks ago and absolutely loved it. Tasted like I ordered it right from Five Guys, my actual favorite place to go get a burger, although rather pricey. Today I went back expecting the same results as I did last time but not even close to it. I did get a milkshake this time though which did NOT let me down. As for the burger on the other hand, a completely different story. it tasted as if it was burnt but cold at the same time. And then the condiments I had put on it were put on all sloppy, but the burger just by itself made me feel unsanitary. definitely going to give it another try at some point though since I'm over there every Tuesday around dinner time\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Lauren B.",
    "yelp_id": "xh58815kkS461jFEoDju8A",
    "user_location": "Franklin, TN",
    "rating": 2,
    "review_date": "3/7/2016",
    "comments": "Food is always incredible but the service ROYALLY SUCKS!! Every time I'm there in the drive thru they get the order wrong. The little box we have to talk to is hard to hear. They need to get with it and match the service with the excellent food. The menu is confusing but those cobbler milkshakes are to die for.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Lan T.",
    "yelp_id": "WfpQ6O7qQztSH9QeQYm78A",
    "user_location": "Nashville, TN",
    "rating": 3,
    "review_date": "8/15/2016",
    "comments": "The burgers were all right, nothing to really raved about. However for it to be a place for late-night munchies it was an okay spot. The when you offered a variety of things from hamburgers to quesadillas.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Atom G.",
    "yelp_id": "9DH8p7HJA1Yd6aoiNLew8A",
    "user_location": "Winter Park, FL",
    "rating": 3,
    "review_date": "2/8/2016",
    "comments": "I eat here all the time and love the food but for Christ sake will you please get my friggin order right? I would call and complain but no can do because your phone number is not on the Internet....you guys need to tighten up and at least get back in touch with me about all the times you screwed my order up. I have documentation.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Timothy H.",
    "yelp_id": "-0H6Rm6dCi3pkFBC26HsoQ",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "10/4/2015",
    "comments": "One of the best in Nashville....Good deals for the priceI eat there every time im downtown\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Joshua O.",
    "yelp_id": "LC1GKMmgVlCoAjeke418mw",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "3/25/2016",
    "comments": "The food is pretty good however I didn't get the chance to really read all of the menu before I stepped up to order. Probably would've ordered differently had I taken a little more time to read it. The cookout tray seems to be an awesome deal where you get one entree with two sides and a drink for $4.99. There's almost no combo in fast food for that price these days. The burger tastes like it was cooked on a grill in a buddy's back yard. The shake shouldn't be confused with the drink through a straw milkshake. This is more of spoon kind of dessert. Overall happy with my $5.99 spent here.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Ben L.",
    "yelp_id": "zBwmbYuuNdS6Zgmz2Sa66w",
    "user_location": "Murfreesboro, TN",
    "rating": 1,
    "review_date": "7/16/2015",
    "comments": "If I could give it zero stars I would. This place is a joke. I could have gotten a better burger at Burger King. I went through the drive through and they got my order wrong. I ordered the fries with cheese/no chili and the \"Huge\" Cheddar Style hamburger. And this is what a receive, fries with this nasty looking chili and cheese and terrible looking hamburger. They consider this to be \"huge\", what a joke. I will never be back. Please look at the pictures and think to yourself, for what I just paid for this crap, I could go right down the street to Five Guys and get a much better burger for the same price. I'm wishing I would have done the same.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 2,
    "votes_cool": 1
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "BethAnn S.",
    "yelp_id": "eAWnP9ZeVo8kp808y-0LXA",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "2/3/2015",
    "comments": "I have SOOO many friends that were excited to see Cook Out sign on Broadway that I figured this place must be rocking. I finally made it over there and last week with someone from work. The signage was, um, less than exceptional so it was hard to know what to expect. They have a very busy drive thru and teeny tiny walk up counter with 2 cashiers and a place they give you the food when its ready. This is absolutely the bottle neck of the place. The tiny ordering place has a even smaller menu mounted at eye level if you are 17 feet tall.The vibe is VERY fast food with plastic booths that are better than say, McDonalds?, and there is counter with stools on either side and and a charging station in the middle. Okay....now to the good part. Food. I got a bbq burger thing, onion rings, fries and a shake. Don't judge me people! I was sharing and I NEEDED to eat those onion rings so Yelp could know! Onion rings - actual onions. Like yummy onions in crunchyness, fries - meh. A little floppy but a mash up of homestyle friens that are on the greasy side. Hamburger - totally solid fast food burger, tasty bun. And the shake. Holy mother....the shake. That thing was amazeballs. Like flip it upside down and it ain't moving thick deliciousness. And like 300 flavors (hello....hard to figure it all out for us wee people not 17 feet tall). So add on my buddies shake and burger, another shake to take back to a co-worker and this whole stinking mess of calories tallies up to $18.41Take that Catbird Seat. You can have dinner here for two every day for a MONTH for the price of 2 dining there. Okay, you could eat dog food too, so this is probably a bad comparison.Bottom line: Awesome shakes, clean, INEXPENSIVE and way better than a burger I've had at a fast food place.Oh, and my undergrads tells me this is the go to half drunk place to get food on campus. If that's your thing.\n        Was this review …?\n    ",
    "votes_useful": 5,
    "votes_funny": 5,
    "votes_cool": 3
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Cathryn D.",
    "yelp_id": "kPxC8I5NMpM2u8J9ZWbsAA",
    "user_location": "Hermitage, TN",
    "rating": 5,
    "review_date": "6/21/2015",
    "comments": "If your looking for a good and CHEAP drive through besides the standard McDonald's, Dairy Queen then this if the place to go! My husband and I were on a random drive and had planned to go through somewhere else when we saw this place and turned back around and boy are we glad we did!We drove through the drive through although you can go into eat it does look small but none the less the menu was full and a tad confusing but we quickly decided on two double burgers with bacon may and cheese a hot dog as well for the hubby and a shake for him because how can you say no to a shake with a burger?Pulled up food was fresh and ready, first for my husband was the hotdog and it was delicious, had a slight bbq sauce flavor to it....yum yum! Burgers were excellent fresh bacon none of that microwave crap as my husband noted huge plus for him! His peanut butter fudge shake was so good that we drove through once we were done eating in the car for me to get a chocolate shake!The best pay for all that food and drinks we walked away spending roughly $22 we will be back!\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Brent W.",
    "yelp_id": "lHIQXHgxSLzMtJFUWn67Sg",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "9/6/2015",
    "comments": "I just keep stopping off here with my teenager and trying everything on the menu. It's fun food. Not necessarily sustainable, but worlds away from any other fun food fast food yuck. I'm not a drive through person. Crapping up the car with food stink and crumbs is wrong. There is always good music and culture going on in this place. It's an extravaganza of good mix in every way. Two people price for the experience is anywhere between 11 and 14 bucks. Order the tray. It's priced at five bucks. Add a shake for 2 bucks if you don't want the huge tea or the soft drink.\n        Was this review …?\n    \n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 1,
    "votes_cool": 11
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Cam C.",
    "yelp_id": "TQgYJyTZeChy2fcDDlm92A",
    "user_location": "Brentwood, TN",
    "rating": 5,
    "review_date": "11/13/2014",
    "comments": "Ok, possibly some of the best fast food I have ever had...and at a great price! This place is what Back Yard Burgers should have been.\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Nicole C.",
    "yelp_id": "Rh1w1KTSHhhw4PUI0PeBGQ",
    "user_location": "Cumming, GA",
    "rating": 4,
    "review_date": "11/22/2015",
    "comments": "Seriously for what it is ... The food is Just what u want for the PRICE! I mean YUMMMMMY FOR $4.99\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Melissa B.",
    "yelp_id": "ivW0Vad81qJ8SIgqJ8p1Mw",
    "user_location": "Charleston, WV",
    "rating": 3,
    "review_date": "12/12/2014",
    "comments": "My first visit and it was OKAY!!!I am giving them a middle of the road review, and I will definitely try them again, hoping for a better experience. To their defense it was peak lunchtime and the drive thru..so sometimes NOT the best experience.While placing the order, the cashier seemed a little rushed on his end and rude...I placed my order for the Nashville tray with 2 hotdogs (chili onions mustard and ketchup) hushpuppies and fries with a bottle of water..$6 something...then I got my order, my hotdogs were cold...but my fries and hushpuppies piping hot..the fries were good, honestly good, fresh , crisp on the outside and soft inside..I loved themlightly salted not overly salty...good fries...10 stars for the fries.The hushpuppies were hot and crisp...and a little sweet to the taste. I would definitely eat them again..I give them 8 stars...the hotdogs...oh how I really wanted to love them dawgs...I love a good hot dog..but NOT THE CASE here...but I will give them another chance to wow me...I did like the char coloring on the weiners like my grill at my parents when daddy does the cooking..but that was the only GREAT feature...the taste was just not there..they seemed to hurriedly dumped an entire container of mustard on my dawgs..or that is how it tasted..2 stars on the dawgs!!!Sorry Cookout..not my favorite place yet!!!fingers crossed for my future purchase!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Michelle N.",
    "yelp_id": "7T6k12_nkYHeR6L-IfmAFg",
    "user_location": "Brentwood, TN",
    "rating": 5,
    "review_date": "6/29/2015",
    "comments": "MILKSHAKE HEAVEN.  I literally have not had any solid food here, because I cannot pass on the milkshakes.  From Banana to Orange cream to cheesecake to chocolate, yum.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Chris A.",
    "yelp_id": "-SigNCNItQDtSq27j0t_tw",
    "user_location": "Nashville, TN",
    "rating": 2,
    "review_date": "11/10/2014",
    "comments": "I can't understand why everyone is going apeshit over Cook out. The menu is pretty elaborate for first-timers. They have all these options, and its really confusing. I got a plain burger with onion and mustard and ketchup. With a side of fries and chili. You get the option of two sides, which include all kinds of options. The burger was good. They took a whole onion and sliced it so its as if I had a second patty that was nothing but an onion. -completely unnecessary. The Chili was essentially Taco Bell Meat in a styrofoam shot glass. Its not chili, just meat. No beans, nothing. Since I am a normal human being that prefers to drink unsweet tea, I had to wait for them to make more. They do have two GIANT containers of sweet tea. Even after living in the south for more than ten years, I never got used to drinking the sugar-laden tea down here. So instead of being like a normal restaurant, and using one container for sweet and one container for unsweet, I had to specifically ask for unsweet. The two giant containers weren't even labeled. So I had to do the math. Lastly - and I know this isn't that important, but they have a bunch of bible verses and \"god bless america\" on their packaging. I love eating Christian businesses that don't make it their business to shove bible verses down our throats. (In-n-Out, Auntie Anne's) instead of places that do (Chick-Fil-A, Cook out) To each their own. Its their business but I think I will not be eating here much if ever. I will be wiling to try the other things on the menu. Once everyone quits having orgasms over the place. People, please... its a fast food joint!\n        Was this review …?\n    ",
    "votes_useful": 4,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Bonnie C.",
    "yelp_id": "Z8J4qMasGtEYqq11pR8lnQ",
    "user_location": "Franklin, TN",
    "rating": 5,
    "review_date": "12/25/2014",
    "comments": "The peanut butter and banana shake is worth the trip!  Being from NC, I have been a long-time fan of The Cookout.  Love that style of hot dog and if you dare, get the Cookout Style burger.  It's the taste of the Carolinas right in Nashville!BIG FAN!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Amie C.",
    "yelp_id": "_DyQFk4IYIX32IKybZwyLQ",
    "user_location": "Philadelphia, PA",
    "rating": 1,
    "review_date": "4/13/2016",
    "comments": "Visiting from out of town.  Went looking for a late night CHEESEBURGER.  Found this place.  You had ONE JOB...just one.  I ordered a cheeseburger, fries, onion rings and a chili cheese hot coney aka hot dog as your people didn't know what coney means...guess it's a NY thing.  Anyway, got back to my hotel to find out I got a hamburger, which I hate, no cheese...which is what I ordered.  Also, a napkin and ketchup for my dry fries would have been nice thanks.  Oh and I did try to call...the phone rang and rang until someone picked it up to hang it up.  Never again with this place!!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Laana D.",
    "yelp_id": "fxI3xIdcI7Ewb3vmHzlA6w",
    "user_location": "Antioch, TN",
    "rating": 1,
    "review_date": "5/23/2016",
    "comments": "When I came and made my order they didn't even acknowledge me and the cashier was extremely rude. She felt annoyed that I interrupted her because she was talking to her friend who was at the counter. I paid for my food but when I went to get water the cashier yelled out you have to pay for that. I said ok for water. It was 38 cents. I gave her the exact change and she claimed I thru the money at her. Which I didn't. I work in the restaurant business. I know how it is. She told her manager and the manager came asked if she was ok. Like it's all my fault. Please don't come here. I beg of you. Please don't come here\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Ryan B.",
    "yelp_id": "vNTIw7KCKcRi6s9NJPzGTg",
    "user_location": "Nashville, TN",
    "rating": 3,
    "review_date": "1/8/2015",
    "comments": "Ordering here for the first time is a bit chaotic. It's a tiny serving counter/order station for the building size and things are not done in an orderly fashion, if you dig that.The menu is not as simple as most to navigate, and the staff didn't offer much help.The food was good. The burger was basic but filling; there weren't quality issues. The shake was very good.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Andre M.",
    "yelp_id": "SGrlOkA8wfehd4mEuH2qsw",
    "user_location": "Durham, NC",
    "rating": 5,
    "review_date": "12/11/2014",
    "comments": "In the context of a fast food restaurant this is one of the better burgers you'll find in Nashville. What makes it uniques is it indeed does taste like a cookout burger with its flame grilled taste as opposed to the usual fried patty you'll find at any other restaurant. Fries with cajun seasoning were unique and had a great taste. If I have to get a drive thru burger in Nashville ever again this is the place I'll choose. So long 5 Guys...\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Ryan P.",
    "yelp_id": "GY8Wr9AwdFmlTKKreAqijA",
    "user_location": "Gallatin, TN",
    "rating": 4,
    "review_date": "7/3/2015",
    "comments": "First time here.  This is a cool, different QSR to all of the other chains out there.  The burgers & fries tasted good, and the shakes were awesome (banana pudding is the one we had).  My wife had the 1/4 lb burger, and I had the double that was on the combo list.  The burgers weren't huge by any means, nor were they remarkable, but they were good (and different) for the price.  The fries weren't greasy and had a nice crisp to them.  We had to try the shakes, but we ended up getting the same one.  Banana pudding was probably one of the best \"fast-food\" shakes I've had.  There were chunks of banana & cookies in it, especially at the bottom.  We had to use a spoon!  We each had a combo of a burger, fries (double order), and a shake, all for $13 and change.  I thought the price was good for what we received.The place was packed at 2pm!  I think most of it was due to a lot of Belmont students being there for some reason, but the place was still busy even after they left.  There was something a little screwy with their drive-thru area.  They had an attendant outside asking every person that came through if they were going through the drive-thru or parking.  There were cones set up to divide the two lines (drive-thru & inside dining).  As soon as you pulled into the parking lot, you had to stop to talk with the attendant first.  If more than 2 people happened to turn in at the same time, it'd back up into the street.  I'm not sure if the person is out there every day, but it kind of looked like it.  Maybe, it was only during their rush hour.  Parking was definitely tight.The cashiers weren't rude, but they weren't overly nice either.  They had their \"script\" of what to say to people, but I didn't notice any of them even cracking a smile.  A mumbled \"have a good day\" or \"my pleasure\" is worse than not saying it at all.  The best part about our experience was a guy whose name I found out is DJ.  He was the busboy/custodian (?).  He was practically running around the place non-stop cleaning tables, sweeping, and refilling lids, straws, napkins, etc.  I've never seen a restaurant so busy at 2pm, and I've never (never!) seen someone work as hard as he was in a fast-food place.  It wasn't 10 seconds after someone left a table before he was there cleaning it.  The icing on the cake was that he would briefly stop sweeping or cleaning each time someone passed him to leave, look them in the eye, and say \"have a good day/have a nice 4th of July\", and he said it with a genuine smile!  A real smile!  These things are like spotting Bigfoot in fast-food restaurants, or even dine-in restaurants for that matter.  The cashiers at the front could definitely learn something from this guy.  Here was DJ, a guy that simply took pride in his work and genuinely seemed to wish people a good day.  That is few and far between these days.  If anyone from the Cook Out company is reading this, DJ needs not only a promotion, but he should be recognized for his work ethic.  Of course, I say the next thing not knowing his complete skillset, but I'd rather see him behind the register or even as a manager rather than the people that were there.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Casey P.",
    "yelp_id": "dPNhS-8cbaxVd1n2iAdBjA",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "4/8/2015",
    "comments": "So I didn't even see my original review on Yelp, so I don't know if anyone can even read this (because Yelp likes to pick and choose reviews to post ).So update: today at 12:44 am (4/8/15 ) I ordered a \"huge\" burger. It was nothing like they had served before. I got TWO beef patties and the taste was seriously awesome. Good job guys.\n        Was this review …?\n    \n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Lori B.",
    "yelp_id": "s9LAoESSF92HupbRW1P1hw",
    "user_location": "Madison, TN",
    "rating": 4,
    "review_date": "9/20/2015",
    "comments": "Actual beef burger. You know the kind u cook at home and it shrinks and changes shape. No fillers. great pricing. Got burgers dogs chicken and bbq sandwichs.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Mark H.",
    "yelp_id": "RGlCPfblnyRRi5mpxHskAw",
    "user_location": "Aurora, CO",
    "rating": 3,
    "review_date": "5/17/2015",
    "comments": "Good stuff...   Especially for fast food.  It's not a gourmet experience but it's pretty good and the food is always fresh and hot which is more than you can say for just about any other fast food place. A welcome addition to Nashville and West End imho.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Allison B.",
    "yelp_id": "soSEOm_ovbKOPqf-Ia0XOw",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "5/26/2015",
    "comments": "I fricking love this place!! Great food (I always get the BBQ plate), a variety of yummy milkshakes, low prices, and they're open until 4am!! Best after-the-bar drunk food. Not to mention I've never had any issues with order accuracy or customer service. I always brag about this place to my friends that haven't had it :)\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Jennifer B.",
    "yelp_id": "XhnT6KpC9GjvvTWEm06W-Q",
    "user_location": "Hoboken, NJ",
    "rating": 5,
    "review_date": "4/11/2015",
    "comments": "I find it humorous people are complaining about the food quality.  What do you expect when you pay $4.99 for a burger 2 sides and a large drink?  Food tastes much better than McDonald's and cheaper too.  Plus they have crushed ice in the soda fountain and use styrofoam cups.  Your drink will stay cold and not watered down for hours!!\n        Was this review …?\n    ",
    "votes_useful": 2,
    "votes_funny": 1,
    "votes_cool": 3
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Allison W.",
    "yelp_id": "Iety-lg6FLlz7oSx6Ziizg",
    "user_location": "Marietta, GA",
    "rating": 5,
    "review_date": "7/27/2015",
    "comments": "If a milkshake could save your life, the watermelon shake did it for me. I can only hope it visits me in my dreams. The burger reminded me of what my dad used to grill up, not perfect but delicious and nostalgic. I  confident I was eating beef, which is questionable at other fast food joints. Yum...\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Kellen S.",
    "yelp_id": "FdYBwh8qPO6UEhnhp6Eiww",
    "user_location": "Jackson, TN",
    "rating": 5,
    "review_date": "3/26/2015",
    "comments": "Good fast food joint, they offer a variety of food. The cookout tray is the best you get 1 entree and 2 sides and a drink for 4.99....and the sides are like hots dogs,fries,chicken nuggets, and chicken quesadilla. Plus they have really good shakes.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Jim V.",
    "yelp_id": "ir3TO7sVulMac_ke6IdBAg",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "12/16/2014",
    "comments": "After reading some of the reviews I am somewhat puzzled. This is a FAST FOOD restaurant. The quality you expect is the quality you'll get. In my opinion, this is one of the best fast food restaurants around. They offer tons of options from a wide variety of food groups. The quality is pretty good for the price too. This establishment hasn't been around awhile, so give it time on the service. Let the the managers get their processes and procedure establishment before we past judgment on how this restaurant is ran. I will 100% give this establishment a try again. When I leave work every night I see an ever growing line through the drive thru. So I don't think a couple of yelp reviews who view this eatery as negative will hinder the consumers decision to dine there.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 2
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Matthew C.",
    "yelp_id": "jrfTjfWEtS7iUZd04GU6UA",
    "user_location": "Pike Road, AL",
    "rating": 1,
    "review_date": "7/4/2015",
    "comments": "It all started when I walked in the door. It was completely packed and it was a fight getting to the cash register. After about 40 minutes of waiting in line, I finally ordered one burger. Half an hour later, I got the burger I ordered.The burger was cold, had toppings I did not ask for, and was very small. To top it all off, a large group of college students in here with me ordered a long time before me, and got their meals about an hour after I got my food. After finally getting their food, the loud claps and cheers erupted from their group. My friend got the milkshake and didn't make it halfway through it before he threw it away. Just stick with McDonald's if you're in a rush.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Julie K.",
    "yelp_id": "pzfXqoFmNS1q5xdsHAHqSw",
    "user_location": "Pegram, TN",
    "rating": 5,
    "review_date": "4/27/2015",
    "comments": "Come here ever so often.. Tonight I got the BBQ and a banana chocolate shake it's to die for amazing!! Girl at drive thru was very polite.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Melissa L.",
    "yelp_id": "8zkkuk8KOoNojZhTx0j5KA",
    "user_location": "Brentwood, TN",
    "rating": 3,
    "review_date": "12/16/2014",
    "comments": "I am going to give this a 3 star just because it's fast, fresher and better than chains like McDonald's and for what you get, cheaper.  It's nothing special and nothing great but just a relatively decent burger.  Onion rings were good.  The chili however was pretty bad in my opinion.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Gary M.",
    "yelp_id": "8BW_u5cp4Y7vNRSpGBIu0Q",
    "user_location": "Nashville, TN",
    "rating": 2,
    "review_date": "10/17/2014",
    "comments": "I gave them 2 stars because it was cheap. We got two burgers, chicken tenders, nuggets, fries, and a milk shake. The burgers are the same burgers you get at most golf courses. They were ok but dry. Nothing special. The tenders were ok. About like most fast food tenders. The fries were terrible. The onion rings were ok. Again just average. The nuggets were awful. They reminded me of tv dinner nuggets. We also got shorted an order of onion rings. My wife said the shake was good.\n        Was this review …?\n    ",
    "votes_useful": 3,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Wesley W.",
    "yelp_id": "wkjBBU92r7VNDyCo57FQVA",
    "user_location": "Clarksville, TN",
    "rating": 1,
    "review_date": "5/30/2015",
    "comments": "Unbelievably terrible service. When we walked in the woman that took our order didn't look at us or even acknowledge us. After giving half our order she said \"oh I'm done with you.\" Confused, we asked if she knew we wanted four burgers, and she answered \"oh\" like we were inconveniencing her. We got our food and left. The burgers were delicious but the chicken sandwich consists of a piece of dried up chicken with nothing on it. An order of onion rings means you get three very small ones... Won't ever be going back and would never recommend this place to anyone.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Jeff L.",
    "yelp_id": "727eErqSyr0he-IGw_JabA",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "12/8/2014",
    "comments": "I had never been to a Cook Out before so I figured I'd give it a shot when this one opened within walking distance of my office.  The burger I got was honestly pretty average.  Five Guys has a much, much better burger.  That being said, I got a milkshake with my order and it might just be the best and thickest milkshake I've ever had.  I'll try something other than a burger next time, but I'll definitely be back for another milkshake.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Matt T.",
    "yelp_id": "wWoxk9x6rU3xcrbxYE6ufw",
    "user_location": "Westside, Las Vegas, NV",
    "rating": 4,
    "review_date": "4/23/2015",
    "comments": "Neat little spot for fast food. Quality was better than the price.  Very busy at midnite.  Busy with college students.  Not sure what the 2 armed security guards are for.  For me it hit the spot.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Stephen W.",
    "yelp_id": "DXDtSymnniqwSoEPHDrEWw",
    "user_location": "Myrtle Beach, SC",
    "rating": 1,
    "review_date": "1/30/2015",
    "comments": "Pretty awful set up inside. It is so hard to move around at the cash registers and drink stations. Why anyone puts drinks right where the line to order is, I'll never know. The menu was hard to read, so many options all crammed together in bad font. After ordering I walked into the bathroom to wash my hands and found a young man washing his junk in the sink with his shoes off. Not the homeless type I would see in NYC, but just a dude. I guess this is to be expected downtown? There was an employee who walked in right before me, said nothing to him, walked out again. I was hoping the food here wasn't pre-made Sysco style food, but it is. My chicken sandwich was the breaded before frozen type instead of hand breaded in the back like at chick-fil-a, God bless them. It also was broken in half when I picked it up one half fell out of the sandwich. Awesome.My onion rings were the same, frozen rings pre-breaded, kinda gross. The ranch dipping sauce was Helman's (just tasted like mayonnaise), really? I guess I'm just used to everyone in this town making their own sauces and I look forward to everyone's take on the classics. This place is all standard junk. I won't be coming back.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 1,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Joe K.",
    "yelp_id": "TTibuRAx2gxu-nVAymFijQ",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "10/22/2014",
    "comments": "First time in and I'm digging it! Got the cheddar burger! Your options for sides are ridiculous! There's so many and good ones! I got onion rings and cole slaw! Both we're great! I ended up putting some slaw on my burger as well which was great! Felt great after eating there and the rest of the evening! It was also my first time experiencing cheerwine, and it is amazing! This will be my only fast food stop from now on!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 2
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Darleen D.",
    "yelp_id": "_pmllVgrK8xvvTJq53jIZQ",
    "user_location": "Eureka, MO",
    "rating": 4,
    "review_date": "11/9/2014",
    "comments": "New Great burger and hotdog joint near Vandy for such a great price! We paid $4.98 each for a full meal deal with 2 sides Fries, onion rings, corndog, cole slaw, etc and drink. Service is quick and food pretty good.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 1
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Patrick L.",
    "yelp_id": "ASx5FWH4a_JdmGk7_3IBew",
    "user_location": "Concord, NC",
    "rating": 4,
    "review_date": "10/20/2014",
    "comments": "Fast and friendly service. Open late 4 am even during the week.  A wide variety on their menu and much of their menu is cook to order.  The front staff are very friendly and helpful if it's your first time there.  As a native of North Carolina I'm happy to see cook out finally in nashville.  Wash down your meal with some delicious Cheerwine.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 2
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Joe C.",
    "yelp_id": "SkSk_EnsexJlWpBDYrNA7A",
    "user_location": "Nashville, TN",
    "rating": 3,
    "review_date": "4/21/2015",
    "comments": "Everyone knows the food is good but my experience tonight was slower than slow service.  Over 15 minutes to make a shake for someone in the dining room? I skipped the long drive thru line to end up waiting even longer. Shakes are one of the things your supposed to be good at. very disappointed today.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Alexandra F.",
    "yelp_id": "qVEOVvc9gB29v7IAWsnA_g",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "11/6/2014",
    "comments": "This place is pretty cool. For lunch I got a Cajun chicken wrap and a corn dog. The food tasted good! The tea was good. You can get sweet or unsweet. They had a lot of options. Corn dogs, hamburgers, hot dogs, fries, chicken tenders, etc... I got take out and it was ready in just a couple minutes. Fast and good. Will definitely go back. Also my bill was $4.12. It's so cheap, you can't afford not to go there. Also I hear they are open very late so that's awesome!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Sarin K.",
    "yelp_id": "KmtZqu0joBIx9oUKxUd5pQ",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "11/11/2014",
    "comments": "We don't usually eat fast food, so I was pleasantly surprised that I really liked the food, burger was really good, not the best in nashville but amazing for fast food, the coleslaw was really good, the fries are one of my favorites in nashville!!\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Jen W.",
    "yelp_id": "uBfUqpjwkoFXUN9WyshBlA",
    "user_location": "Honolulu, HI",
    "rating": 4,
    "review_date": "8/8/2015",
    "comments": "Mmhmm! That IS a tasty burger! I think it says it all when you see five guys staff coming here to eat after work. Food feels and tastes real unlike other fast food burger joints. My one negative is, much as the Oreo milkshake is yummy, I prefer it when I can get it through the straw!! (Seriously thick shake)\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Bridget O.",
    "yelp_id": "qfqCD_cUKh84jcYVVmVpUQ",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "11/2/2014",
    "comments": "Great food, even better milkshakes. Prices are awesome! Be sure to check your order. Got back to the office and was missing my sides. They were great about making things right on my next visit however.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "cook-out-nashville",
    "user_name": "Phil J.",
    "yelp_id": "xJmFXCfRy5zZFBR7Gxrh6A",
    "user_location": "Nashville, TN",
    "rating": 2,
    "review_date": "3/1/2015",
    "comments": "Was curious, never had been here before, saw positive and negative reviews.  Arby's is better.  burgers are dry, staff are overtly disinterested, onion rings weren't even fully thawed.  I don't know what happened.  oh, and then I saw in the news later last night someone was killed here and another guy shot.  so I definitely will be avoiding this place.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "meridian-cafe-nashville",
    "user_name": "Yolanda M.",
    "yelp_id": "kbn7R1aKzQpqeH74IZ7A4A",
    "user_location": "Madison, TN",
    "rating": 5,
    "review_date": "12/10/2016",
    "comments": "I had salmon croquettes, potatoes, eggs and wheat toast. Everything was delicious!!! They are very friendly\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "meridian-cafe-nashville",
    "user_name": "Jenifer G.",
    "yelp_id": "jqyCC_CE1KY6oSX8xD-FZg",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "10/27/2016",
    "comments": "I'm a bigger fan now, 4 years after being the first reviewer, now as a breakfast customer. I'm thankful they're still here so I could re-assess. The salmon cakes are crispy outside, soft inside, and delicately flavored. Two pancakes will fill you up. The hash browns are an interesting reformatting of tater tots, seasoned well and crumbled. This is a spot where people seem to come often, if not daily, though I don't feel excluded.My only warning: You will walk out with your clothes smelling like something fried. It's a great reminder of what you had, but be sure you're not going to a formal event after.\n        Was this review …?\n    \n        Was this review …?\n    ",
    "votes_useful": 4,
    "votes_funny": 1,
    "votes_cool": 1
},{
    "restaurant_id": "meridian-cafe-nashville",
    "user_name": "Jarrett M.",
    "yelp_id": "XL5ED9iAVo4nNo8PxIsIWg",
    "user_location": "Nashville, TN",
    "rating": 5,
    "review_date": "5/30/2015",
    "comments": "A great place to have breakfast for the low. The food was great. Service was wonderful and very helpful. You get a lot of food for a low cost.\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "meridian-cafe-nashville",
    "user_name": "Demetrice R.",
    "yelp_id": "d5CIQo8I5KlbBpVXXYKkGQ",
    "user_location": "Mount Holly, NC",
    "rating": 3,
    "review_date": "1/21/2015",
    "comments": "The service was excellent and the food was good, tasted like home cooking. The only reason I did not give it a better rating is because the hours of operation are so limited. I will definitely visit Meridian again for breakfast or lunch  (dinner is not an option).\n        Was this review …?\n    ",
    "votes_useful": 0,
    "votes_funny": 0,
    "votes_cool": 0
},{
    "restaurant_id": "meridian-cafe-nashville",
    "user_name": "Keri W.",
    "yelp_id": "cqeVZYEFZd_ee1WcFj6AgA",
    "user_location": "Nashville, TN",
    "rating": 4,
    "review_date": "1/2/2013",
    "comments": "I enjoyed the food at the Meridian Cafe.  The cornbread was great, and I really liked the sweet potatoes and the green beans.  The fried chicken was unfortunately a bit dry.  It is VERY reasonably priced and the portions are big.  The staff is friendly.\n        Was this review …?\n    ",
    "votes_useful": 1,
    "votes_funny": 0,
    "votes_cool": 0
},