[{
    'restaurant_id': 'edgehill-cafe-nashville-4',
    'user_name': 'Ian R.',
    'yelp_id': '26YpEJpa4uwJ60ezG9MIfQ',
    'user_location': 'Nashville, TN',
    'rating': 4,
    'review_date': '1/19/2011',
    'comments': 'Let's be honest, there is not a huge difference in the coffee from one coffee shop to another.  Aside from the big chains almost all the local coffee shops in town offer a very good cup of joe.  So what makes a difference?  In my mind it is the setting.  A good coffee shop should be a place that you want to set up camp at and let a rainy day pass you by with a nice beverage and something to read.  That is exactly what me and the wife did recently at Edgehill Cafe.  As soon as we entered we were very impressed.  The interior is a kind of rustic modern that is really inviting.  Great mix of steel, wood and concrete that really stands out.  The menu was fairly creative even though they were out of lox on the day we went so the wife had to go with her second choice quiche.  I got the Turkey, pear, brie sandwich.  Two large cups of coffee to wash it down.  Food came out quickly and the service was very good.  The coffee was really nice and balanced, good for both sipping and to match with food.  The food was not quite up to the same standard.  It was good, but nothing really stood out.  My wife was particularly disappointed with the quiche, which was completely overwhelmed by the turkey sausage and even though the crust was good was just kind of unsatisfying.  Overall probably a 2.5 for food, 3.5 for coffee.Still, even though the food did not knock our socks off the atmosphere more than made up for it.  The furniture is eclectic and genuinely beautiful.  In fact if you were to go over to the antique stores on 8th I imagine most of the furniture in Edgehill would go for more than a grand.  The vibe was relaxed and there is even a nice selection of photo and art books to enjoy.  We ended up getting refills and just watching the rain.  So five star atmosphere with 3 star food and drink makes for a solid 4 stars.  I don't know if I will be back to eat, but Edgehill cafe is definitely on the shortlist for rainy day destinations.\n        Was this review …?\n    ',
    'votes_useful': 1,
    'votes_funny': 0,
    'votes_cool': 1
},{
    'restaurant_id': 'edgehill-cafe-nashville-4',
    'user_name': 'Rocky T.',
    'yelp_id': '81RszoS7_X0yoRVKdvILrw',
    'user_location': 'Nashville, TN',
    'rating': 3,
    'review_date': '6/24/2011',
    'comments': 'Went there yesterday for a Yelp sponsored event, so not sure if it is a good representative of the actual experience. But nice kitchy-trendy atmosphere. Food and wine was good (though I think its just a coffee and sandwhich shop). Would be interested to go back as a regular customer to get a better feel for how they are.\n        Was this review …?\n    ',
    'votes_useful': 0,
    'votes_funny': 0,
    'votes_cool': 0
},{
    'restaurant_id': 'edgehill-cafe-nashville-4',
    'user_name': 'Suz J.',
    'yelp_id': 'EOTvts_6Xdg5NHNqgjV0Pw',
    'user_location': 'Nashville, TN',
    'rating': 4,
    'review_date': '12/13/2009',
    'comments': 'Wendy at Edgehill hosted a toy drive event yesterday for the Marines Toys For Tots charity. Two bands played and there were free gingerbread cookies and hot chocolate. Toys For Tots is a good annual Holiday toy charity drive where restaurants and other businesses can put a collection box out. It's good PR and it's good for kids in need. I enjoyed the music while dropping off a toy. Email Toys For Tots if you want a box next Christmas in your business. The kids will appreciate it.\n        Was this review …?\n    ',
    'votes_useful': 4,
    'votes_funny': 1,
    'votes_cool': 6
},{
    'restaurant_id': 'edgehill-cafe-nashville-4',
    'user_name': 'james w.',
    'yelp_id': 'PtffT7kwEmR04IG_7u3Tng',
    'user_location': 'Houston, TX',
    'rating': 3,
    'review_date': '1/21/2012',
    'comments': 'location is good, as is the general layout of the place, however the coffee always tastes burned and it kind of smells like wet animal in there.\n        Was this review …?\n    ',
    'votes_useful': 0,
    'votes_funny': 0,
    'votes_cool': 0
},{
    'restaurant_id': 'edgehill-cafe-nashville-4',
    'user_name': 'Terence L.',
    'yelp_id': 'L6vZs24qdRevPl-6vWpFWw',
    'user_location': 'New York, NY',
    'rating': 4,
    'review_date': '4/9/2011',
    'comments': 'came for a saturday afternoon. edgehill cafe is a great place to sit down for a few hours and get some work done. pleased to see plenty of power sockets and places to plop down with a laptop!only had an iced coffee (to herald in the warm months!), but it was balanced and very drinkable. will be coming back.\n        Was this review …?\n    ',
    'votes_useful': 0,
    'votes_funny': 0,
    'votes_cool': 0
},{
    'restaurant_id': 'edgehill-cafe-nashville-4',
    'user_name': 'Daria M.',
    'yelp_id': 'j9VWjlJEtDWhJeNoyHaKag',
    'user_location': 'Nashville, TN',
    'rating': 4,
    'review_date': '9/3/2008',
    'comments': 'Edgehill Studios is definitely a technology-oriented cafe, and they seem to do a good job with that: a long, thin table with an outlet strip running down the middle makes for easy access to power, and there's even a fax machine by the door ($1/page local, $2 long distance).  The three flat screen TVs, each showing a different movie or news program, along with the lack or decorations, and the new, super clean feel contribute to the technology-centric feel I get from Edgehill.  There was some neat art for sale on the walls, a small stage in the corner, and some quiet rock music playing, which kept the cafe from feeling like a computer lab.  Edgehill Studios would be a good place to get some work done when your internet is out or when you're having trouble motivating yourself to study.  The customers seem to be mostly young professional types, and while there were a good ten or so people there, it wasn't crowded, and there were plenty of open tables.  They serve coffee, espresso, chai, soda, bagels, baked goods, soup, and basic sandwiches, all at lower prices than you'd find at most Nashville coffee shops.\n        Was this review …?\n    ',
    'votes_useful': 0,
    'votes_funny': 0,
    'votes_cool': 0
},{
    'restaurant_id': 'edgehill-cafe-nashville-4',
    'user_name': 'Jennifer C.',
    'yelp_id': 'x9W5BujvyNFV5h6d8oAJuw',
    'user_location': 'Nashville, TN',
    'rating': 3,
    'review_date': '10/7/2009',
    'comments': 'This can be a great place to people watch. Some dude from the Mavericks is in there all the time and once one of Josh Grayson's (of 20-minute American Idol  fame) staff was there saying not nice things about him. Ah, to be a fly on the wall. However, every time I leave the place after working on the laptop for a few hours I smell like a panini sandwich and have to change my clothes and shower. The coffee is ok, not great.\n        Was this review …?\n    ',
    'votes_useful': 1,
    'votes_funny': 1,
    'votes_cool': 1
}
]
